{
  "company_name": "Cisco",
  "official_website": "https://cisco.com/",
  "total_urls_found": 8,
  "total_urls_scraped": 8,
  "successful_scrapes": 8,
  "scraped_content": [
    {
      "url": "https://cisco.com/",
      "title": "AI Infrastructure, Secure Networking, and Software Solutions - Cisco",
      "markdown": "- Skip to main content\n- Skip to search\n- Skip to footer\n\nCisco Router 8223 and Cisco Silicon One P200\n\n# Meeting the demands of distributed AI\n\nCisco 8223 router, powered by Silicon One P200, for the scale-across era.\n\nLearn more about the Cisco 8223 routerExplore Cisco Silicon One\n\n\\\\\nDownloads\n\n\\\\\nCertifications\n\n\\\\\nCisco Validated\n\n\\\\\nTraining\n\n\\\\\nCommunity\n\n\\\\\nSupport\n\n## Connect, protect, and thrive in the AI-driven world\n\nUnified Nexus Dashboard displayed on monitor\n\n### Unified Nexus Dashboard\n\nSimplify your data center network with Cisco Nexus Dashboard. Use one console and common policy across NX-OS and ACI fabrics.\n\nExplore Nexus DashboardView data sheet\n\nPhoto of Cisco Wireless CW9179F configuration \n\n### Expanding our Wi-Fi 7 lineup\n\nThe new Cisco Wireless CW9179F ushers in one of the industry's first enterprise-grade, Wi-Fi 7 certified high-density access point.\n\nView Wi-Fi 7 data sheetExplore all wireless\n\nSplunk UI detailing ATT&CK threshold report\n\n### Splunk Enterprise Security\n\nEnterprise Security is now an AI-powered SecOps platform with SIEM, SOAR, UEBA, threat intelligence, and detection engineering.\n\nExplore Splunk Enterprise SecurityGet free trial\n\n* * *\n\nShow more (1)\n\n* * *\n\n## Driving AI innovation\n\nCisco is combining the power of the network with security, observability, and collaboration to lead you into the new AI era.\n\n### Announcing Cisco AI Canvas\n\nWatch how AI Canvas' generative UI brings real-time telemetry, AI insights, and team collaboration into a single shared workspace.\n\nWatch AI Canvas demoLearn about our agentic AI approach\n\nAI Defense UI report detailing events \n\n### Cisco AI Defense: Securing the future of AI\n\nSecure your organization's AI development and usage with the network visibility, mature guardrails, and live threat intelligence updates.\n\nLearn about AI DefenseRequest a demo\n\nCisco and NVIDIA logos \n\n### Cisco Secure AI Factory with NVIDIA\n\nFrom AI PODs for inferencing and training to fully managed Hyperfabric AI stacks, learn how Cisco and NVIDIA are accelerating AI adoption for the enterprise.\n\nExplore Secure AI FactoryLearn about our AI infrastructure\n\n### Mass-scale AI infrastructure\n\nUnlock scalable, high-performance AI with our portfolio of advanced AI infrastructure products and solutions.\n\nExplore advanced AI portfolioLearn about Cisco Silicon One advantage\n\n* * *\n\nShow more (1)\n\n* * *\n\nExplore more AI newsWhy Cisco for the AI era\n\n## Browse by technology\n\n\\\\\nNetworking\n\n\\\\\nSecurity\n\n\\\\\nObservability\n\n\\\\\nCollaboration\n\n\\\\\nComputing\n\n\\\\\nAI\n\nBrowse all productsBrowse all services\n\n## Inside Cisco\n\nOn-demand sessions\n\n### Stay inspired with our featured sessions from Cisco Live\n\nView all featured sessions\n\nBlog\n\n### Powering 6 new NFL club and venue partnerships for 2026\n\nRead blog\n\nPodcast\n\n### How GM maintains network oversight and cybersecurity\n\nHear it from General Motors\n\nPodcast\n\n### Explore Cisco AI PODs: Scalable, secure designs for training, hybrid workloads, and AI deployment\n\nLearn about Cisco's top AI innovations\n\nBlog\n\n### Cisco software that makes distributed quantum computing work\n\nRead about our systems-level approach\n\nArticle\n\n### Back to school in the AI era\n\nRead article\n\n* * *\n\nShow more (1)\n\n* * *\n\n## We've got you covered\n\nThe Cisco difference. Your competitive edge. When you choose Cisco, you get over 40 years of trust, expertise, and innovation\n\nExplore trials and demosDiscover buying options\n\nHello, how can I help?",
      "html": "",
      "metadata": {
        "title": "AI Infrastructure, Secure Networking, and Software Solutions - Cisco",
        "description": "Cisco is a worldwide technology leader powering an inclusive future for all. Learn more about our products, services, solutions, and innovations.",
        "language": "en-US, en",
        "sourceURL": "https://cisco.com/"
      },
      "content_type": "website",
      "success": true,
      "error": null,
      "scraped_at": "2025-10-24T10:47:42.916561",
      "processed_markdown": "- Skip to main content\n- Skip to search\n- Skip to footer\nCisco Router 8223 and Cisco Silicon One P200\n# Meeting the demands of distributed AI\nCisco 8223 router, powered by Silicon One P200, for the scale-across era.\nLearn more about the Cisco 8223 routerExplore Cisco Silicon One\n\\\\\nDownloads\n\\\\\nCertifications\n\\\\\nCisco Validated\n\\\\\nTraining\n\\\\\nCommunity\n\\\\\nSupport\n## Connect, protect, and thrive in the AI-driven world\nUnified Nexus Dashboard displayed on monitor\n### Unified Nexus Dashboard\nSimplify your data center network with Cisco Nexus Dashboard. Use one console and common policy across NX-OS and ACI fabrics.\nExplore Nexus DashboardView data sheet\nPhoto of Cisco Wireless CW9179F configuration\n### Expanding our Wi-Fi 7 lineup\nThe new Cisco Wireless CW9179F ushers in one of the industry's first enterprise-grade, Wi-Fi 7 certified high-density access point.\nView Wi-Fi 7 data sheetExplore all wireless\nSplunk UI detailing ATT&CK threshold report\n### Splunk Enterprise Security\nEnterprise Security is now an AI-powered SecOps platform with SIEM, SOAR, UEBA, threat intelligence, and detection engineering.\nExplore Splunk Enterprise SecurityGet free trial\n* * *\nShow more (1)\n* * *\n## Driving AI innovation\nCisco is combining the power of the network with security, observability, and collaboration to lead you into the new AI era.\n### Announcing Cisco AI Canvas\nWatch how AI Canvas' generative UI brings real-time telemetry, AI insights, and team collaboration into a single shared workspace.\nWatch AI Canvas demoLearn about our agentic AI approach\nAI Defense UI report detailing events\n### Cisco AI Defense: Securing the future of AI\nSecure your organization's AI development and usage with the network visibility, mature guardrails, and live threat intelligence updates.\nLearn about AI DefenseRequest a demo\nCisco and NVIDIA logos\n### Cisco Secure AI Factory with NVIDIA\nFrom AI PODs for inferencing and training to fully managed Hyperfabric AI stacks, learn how Cisco and NVIDIA are accelerating AI adoption for the enterprise.\nExplore Secure AI FactoryLearn about our AI infrastructure\n### Mass-scale AI infrastructure\nUnlock scalable, high-performance AI with our portfolio of advanced AI infrastructure products and solutions.\nExplore advanced AI portfolioLearn about Cisco Silicon One advantage\n* * *\nShow more (1)\n* * *\nExplore more AI newsWhy Cisco for the AI era\n## Browse by technology\n\\\\\nNetworking\n\\\\\nSecurity\n\\\\\nObservability\n\\\\\nCollaboration\n\\\\\nComputing\n\\\\\nAI\nBrowse all productsBrowse all services\n## Inside Cisco\nOn-demand sessions\n### Stay inspired with our featured sessions from Cisco Live\nView all featured sessions\nBlog\n### Powering 6 new NFL club and venue partnerships for 2026\nRead blog\nPodcast\n### How GM maintains network oversight and cybersecurity\nHear it from General Motors\nPodcast\n### Explore Cisco AI PODs: Scalable, secure designs for training, hybrid workloads, and AI deployment\nLearn about Cisco's top AI innovations\nBlog\n### Cisco software that makes distributed quantum computing work\nRead about our systems-level approach\nArticle\n### Back to school in the AI era\nRead article\n* * *\nShow more (1)\n* * *\n## We've got you covered\nThe Cisco difference. Your competitive edge. When you choose Cisco, you get over 40 years of trust, expertise, and innovation\nExplore trials and demosDiscover buying options\nHello, how can I help?",
      "original_markdown_length": 3458,
      "processed_markdown_length": 3375,
      "compression_ratio": 0.9759976865240023
    },
    {
      "url": "https://networkworld.com/article/3523958/cisco-latest-news-and-insights.html",
      "title": "Cisco: Latest news and insights | Network World",
      "markdown": "by Network World staff\n\n# Cisco: Latest news and insights\n\nNews\n\nOct 17, 202532 mins\n\nNetwork Management SoftwareNetwork SecurityNetworking\n\n## Here’s what you need to know about the networking giant’s latest product and company news.\n\nCisco logo and font on dark background. 3D render.\n\nCredit: CryptoFX /Shutterstock\n\nCisco ( Nasdaq:CSCO) is the dominant vendor in enterprise networking, and under CEO Chuck Robbins, it continues to shake things up.\n\nCisco is focusing on strategic AI initiatives and partnerships across various regions to build and power AI data centers and ecosystems. This includes collaborations with major players like BlackRock, Global Infrastructure Partners, Microsoft and Nvidia to drive investment and scale AI infrastructure.\n\nThe networking giant continues to focus on integrating AI into its security offerings, with announcements around Cisco Secure AI Factory with Nvida, which aims to embed security into all layers of AI infrastructure.\n\n## Cisco news and analysis\n\n### ‘Zero Disco’ campaign hits legacy Cisco switches with fileless rootkit payloads\n\n_October 17, 2025_: In newly disclosed real-world attacks, threat actors are found exploiting a Cisco SNMP vulnerability to gain remote code execution (RCE) and install Linux rootkits on vulnerable switches.\n\n### Cisco seriously amps-up Silicon One chip, router for AI data center connectivity\n\n_October 8, 2025_: Cisco has unwrapped a high-end, 51.2 Tbps router and chip that it says will go a long way toward supporting the distributed AI data center workloads of today and in the future.\n\n### Cisco: AI demands more reliable optical networking components\n\n_October 3, 2025_: As AI networking environments become more dependent on optical networking components, enterprises need to pay close attention to the reliability of high-speed optics, Cisco warns.\n\n### Cisco admins urged to patch IOS, IOS XE devices\n\n_September 25, 2025_: Network admins should quickly patch a vulnerability in Cisco Systems IOS and IOS XE software to remove a stack overflow condition in the software’s Simple Network Management Protocol (SNMP) subsystem or risk nasty attacks, say experts.\n\n### Cisco expands its quantum networking portfolio with new software prototypes\n\n_September 25, 2025_: Cisco announced a package of prototype software it says will facilitate distributed quantum computing networks and support real-time applications. Essentially, the software enables distributed quantum computing in the quantum data center.\n\n### Cisco’s Splunk embeds agentic AI into security and observability products\n\n_September 9, 2025_: Cisco unveiled agentic AI-powered security and observability capabilities built to automate threat response, streamline IT operations, and manage complex environments. Splunk Enterprise Security Premier and Splunk Enterprise Security Essentials are designed to unify security workflows across threat detection, investigation, and response.\n\n### Cisco launches AI-driven data fabric powered by Splunk\n\n_September 8, 2025_: Cisco unveiled a new data architecture that’s powered by the Splunk platform and designed to help enterprises glean AI-driven insights from machine-generated telemetry, such as metrics, events, logs and traces.\n\n### Cisco launches dedicated wireless certification track\n\n_August 27, 2025_: Cisco is introducing a new wireless certification track in response to demand for specialized wireless expertise. The Cisco Certified Network Professional (CCNP) Wireless and Cisco Certified Internetwork Expert Enterprise (CCIE) Wireless certifications will replace the CCNP Enterprise wireless concentration. CCNP Enterprise will continue to focus on routing, switching, SD-WAN, security, automation, cloud connectivity, and virtualization.\n\n### Russian hackers exploit old Cisco flaw to target global enterprise networks\n\n_August 21, 2025:_ Russian state-sponsored cyber actors linked to the Federal Security Service (FSB) conducted a decade-long espionage campaign that compromised thousands of enterprise network devices across critical sectors worldwide, according to an FBI advisory. The threat actor, designated “Static Tundra” by Cisco Talos and previously known as “Berserk Bear” and “Dragonfly,” systematically exploited CVE-2018-0171, a six-year-old vulnerability in Cisco Smart Install (SMI), to gain deep access to enterprise network infrastructure and conduct reconnaissance on industrial control systems.\n\n### Cisco ties storage networking gear to IBM z17 mainframe\n\n_August 20, 2025:_ Cisco said its MDS 9000 Series multilayer switches, including the MDS 9148V switch, have been tested and validated for compatibility with IBM z17 mainframe environments. This latest generation of IBM mainframe features new AI acceleration technologies as well as improved management for hybrid cloud applications, encryption and threat detection, and integrated and simplified programming capabilities.\n\n### Warning: Patch this hole in Cisco Secure FMC fast\n\n_August 15, 2025:_ Admins using Cisco Systems Secure Firewall Management Center (FMC) Software for network login authentication are being warned to quickly patch a major vulnerability that could allow a remote attacker to breach security. At risk are deployments configured for RADIUS authentication for the web-based management interface, SSH management, or both, Cisco said in its alert.\n\n### Cisco Q4 results: AI infrastructure orders surpass goal\n\n_August 14, 2025_: Cisco is seeing significant AI infrastructure demand and expects that growth to continue into next year, executives said as the company wrapped up its 2025 fiscal year.\n\n### Cisco strengthens AI networking story\n\n_August 13, 2025_: Network infrastructure is described as the plumbing of the internet, with Cisco chief among the providers. As the AI era unfolds and that plumbing needs modernizing, Cisco is vying to secure its role as a key AI infrastructure provider across enterprise and hyperscaler networking environments.\n\n### Cisco teams with Hugging Face for AI model anti-malware\n\n_August 5, 2025:_ The Foundation AI team at Cisco teamed with AI model hub Hugging Face to bolster malware protection and strengthen security across the AI ecosystem.\n\n### Cisco warns of another critical RCE flaw in ISE, urges immediate patching\n\n_July 18, 2025_: Cisco dropped another maximum severity advisory detailing an unauthenticated remote code execution (RCE) flaw in its Identity Services Engine (ISE) and ISE Passive Identity Connector (ISE-PIC).\n\n### Cisco upgrades 400G optical receiver to boost AI infrastructure throughput\n\n_July 17, 2025_: Cisco unveiled a new optical receiver that lets data center customers better support AI and other high-throughput applications. The 400G bidirectional (BiDi) optical transceiver allows customers to upgrade to higher throughput without tearing out existing fiber\n\n### Hardcoded root credentials in Cisco Unified CM trigger max-severity alert\n\n_July 3, 2025:_ Cisco has patched a max severity flaw in its Unified Communications Manager (Unified CM) and Session Management Edition (Unified CM SME) products that could let attackers walk right in using a hardcoded root login.\n\n### Cisco warns of critical API vulnerabilities in ISE and ISE-PIC\n\n_June 26, 2025:_ Companies are being urged to quickly patch multiple vulnerabilities in Cisco Systems Identity Services Engine (ISE) and Cisco ISE Passive Identity Connector (ISE-PIC) that could allow an unauthenticated, remote attacker to issue commands on the underlying operating system as the _root_ user.\n\n### Cisco CIO on the future of IT: AI, simplicity, and employee power\n\n_June 26, 2025:_ As Cisco infuses its enterprise infrastructure products with AI, the technology is also infiltrating its internal platforms, directed by Cisco CIO Fletcher Previn. His focus is on developing and using AI tools that can change how Cisco and its employees do business.\n\n### Cisco backs quantum networking startup Qunnect\n\n_June 24, 2025_: Cisco Investments is backing Qunnect, a network hardware company that has designs on building quantum communication systems using existing telecom fiber.\n\n### Cisco capitalizes on Isovalent buy, unveils new load balancer\n\n_June 16, 2025_: Since it acquired open-source software developer Isovalent in 2024, Cisco has been busy integrating its technology into some core products. In particular, Cisco has elevated the use of Isovalent’s core container communications technology, Kubernetes-native networking and security platform eBPF (extended Berkeley Packet Filter).\n\n### Cisco underscores AI commitment with networking LLM, agentic AI interface\n\n_June 12, 2025_: A wide range of new AI-based software and technology from Cisco is designed to manage, secure and automate network operations as well as to cement Cisco’s place at the center of customers’ AI infrastructure plans. Cisco rolled out the new wares at its Cisco Live event.\n\n### At Cisco Live, it’s all about AI for networking and security\n\n_June 11, 2025:_ Cisco Live focused on two aspects: AI being used to make Cisco technology smarter and easier to use, and Cisco innovations that will enable customers to adopt AI. An easy way to consider the two buckets is “AI for Cisco” and “Cisco for AI.”\n\n### Cisco Live: Security focus yields new firewalls, Hypershield integrations, and agentic AI defenses\n\n_June 11, 2025:_ At its Cisco Live event, the vendor rolled out a new Hybrid Mesh Firewall portfolio, bolstered security support with partner Nvidia, and further tightened its own technology integration with its Splunk platform. The announcements share a common goal of protecting all things AI – workloads, inferencing, models and more – as Cisco works to secure the core infrastructure that supports the AI build-out.\n\n### Cisco reinvigorates data center, campus, branch networking with AI demands in mind\n\n_June 10, 2025:_ Cisco has upgraded critical components of its network family – including switches, routers and software for data center, campus, branch and IoT – in a major effort to deliver the growing capacity and management capabilities its enterprise customers will need for AI environments.\n\n### Cisco Live: AI will bring developer workflow closer to the network\n\n_June 10, 2025:_ AI is reshaping networking in ways that demand a new degree of programmability, observability, and optimization, Cisco CEO Chuck Robbins said. And if history is any guide, what starts as an infrastructure concern for network and platform teams will eventually trickle down to developers.\n\n### Cisco Wireless LAN Controllers under threat again after critical exploit details go public\n\n_June 3, 2025:_ The heat is back on Wireless LAN Controllers (WLCs) running Cisco IOS XE after technical details of a recently disclosed max-severity exploit were made public.\n\n### Cisco bolsters DNS security package\n\n_May 29, 2025_: Cisco has bulked-up its Domain Name System (DNS) security software with new features including AI-enhanced DNS tunneling mitigation and stronger cloud malware detection. Cisco Secure Access – DNS Defense replaces the current Cisco Umbrella DNS Essentials and Advantage packages and enhances those offerings.\n\n### Cisco taps OpenAI’s Codex for AI-driven network coding\n\n_May 16, 2025_: Cisco is working with OpenAI and its Codex software engineering agent to give network engineers access to better tools for writing, testing and building code. The AI coding agen t is available via ChatGPT and can navigate a codebase, implement and test code changes, and propose pull requests for review, according to Cisco.\n\n### Cisco joins AI infrastructure alliance\n\n_May 13, 2025_: Cisco joinied a group led by BlackRock, Microsoft and Nvidia to develop secure and scalable infrastructure to support AI workloads. The AI Infrastructure Partnership (AIP) includes investors, asset owners, and corporations with plans to raise up to $30 billion for the development of data centers for artificial intelligence and the energy infrastructure to power them.\n\n### Cisco patches max-severity flaw allowing arbitrary command execution\n\n_May 9, 2025:_ Cisco is urging customers to patch for a maximum-severity flaw affecting its IOS XE Software for Wireless controllers. The flaw, tracked as CVE-2025-20188, received a severity rating of CVSS 10/10 because of its high exploitability and the ability to allow arbitrary command execution.\n\n### Cisco unveils prototype quantum networking chip\n\n_May 6. 2025:_ Cisco is developing a quantum entanglement chip that could ultimately become part of the gear that will populate future quantum data centers.\n\n### Cisco automates AI-driven security across enterprise networks\n\n_April 28, 2025_: Cisco announced a range of AI-driven security enhancements, including improved threat detection and response capabilities in Cisco XDR and Splunk Security, new AI agents, and integration between Cisco’s AI Defense platform and ServiceNow SecOps.\n\n### Cisco SVP talks agentic AI, quantum security and sustainable infrastructure\n\n_Aprill 14, 2025_: Cisco is building AI capabilities across its portfolio, including collaboration, observability, security, and network software, to help customers more effectively tackle challenges such as employee productivity and digital resilience.\n\n### Cisco GM underscores focus on issues critical for Spain’s tech development\n\n_April 10, 2025:_ Cisco recently celebrated its 40 anniversary, and its mission to connect the world remains intact. It’s focused on critical areas such as AI and cybersecurity that have worldwide relevance, including in Spain, where Cisco has more than three decades of history, says Andreu Vilamitjana, general manager of Cisco in Iberia, who spoke recently at the company’s Engage event in Madrid.\n\n### Cisco, Google Cloud offer enterprises new way to connect SD-WANs\n\n_Apriil 9, 2025_: Cisco and Google Cloud have expanded their partnership to integrate Cisco’s SD-WAN with the cloud provider’s fully managed Cloud WAN service. For Cisco SD-WAN customers, the integration provides a new, secure way to tie together geographically dispersed enterprise data center sites with their Google Cloud workloads using Google’s core global network backbone.\n\n### Cisco takes inspiration from Iron Man for its AI-driven platform engineer\n\nApril 2, 2025: When it comes to developing highly intelligent AI agents, you might not think of combining open systems technology and the theoretical super-logic behind a movie character, but Cisco’s Outshift development team is doing just that. To address the complexity of platform and infrastructure engineering, Cisco is drawing inspiration from the “Iron Man” superhero franchise.\n\n### Cisco, Nvidia team to deliver secure AI factory infrastructure\n\nMarch 18, 2025: Cisco and Nvidia have expanded their partnership to create their most advanced AI architecture package to date, designed to promote secure enterprise AI networking. The Cisco Secure AI Factory with Nvidia brings together Cisco security and networking technology, Nvidia DPUs, and storage options from multiple vendors.\n\n### Jio teams with AMD, Cisco and Nokia to build AI-enabled telecom platform\n\n_March 18. 2025_: Initiative led by Jio Platforms Limited will combine AMD’s computing solutions, Cisco’s networking and security, and Nokia’s RAN and core technologies.\n\n### Cisco’s AI agents for WebEx aim to improve customer service\n\n_Mar 17, 2025:_ Cisco is adding new features to its Webex collaboration tool as it expands its adoption of agentic AI.\n\n### Cisco CIO Fletcher Previn talks culture: ‘They can steal your technology, but not your philosophy’\n\n_February 26, 2025_: In an interview with _CIO Spain_, Fletcher Previn, Cisco’s CIO, discussed Cisco’s roadmap, discussed AI regulations, advocated for balance among legislation, innovation and risk, and revealed how he approaches shadow IT in his own organization.\n\n### 5 takeaways from Cisco Live EMEA\n\n_February 26, 2025_:  To no one’s surprise, the primary theme at Cisco Live EMEA was AI and how it will change the way we live. And, more importantly, how AI will forever alter how IT pros deploy and operate our IT environments.\n\n### Cisco, Nvidia expand AI partnership to include Silicon One technology\n\n_February 25. 2025_: Nvidia will couple Cisco Silicon One technology with Nvidia SuperNICs as part of its Spectrum-X Ethernet networking platform, and Cisco will build systems that combine Nvidia Spectrum silicon with Cisco OS software.\n\n### Cisco financials catch AI demand, enterprise networking growth\n\n_February 13, 2025_: Cisco executives were upbeat about the growth in AI orders — $700 million so far this year, on way to surpass $1 billion in 2025 – as the networking giant detailed a successful 2Q earnings period this week to Wall Street.\n\n### Cisco doubles down on AI with new, updated certifications\n\n_February 11, 2025_: Cisco this week furthered its commitment to help customers support and develop artificial intelligence systems by rolling out new AI certification and training courses aimed at teaching professionals everything from how to incorporate AI into specific roles to advanced networking design.\n\n### Cisco data center switches feature baked-in security for AI, networking duties\n\n_February 11, 2025_: Cisco has unwrapped a new family of data center switches it says will help customers more securely support large workloads and facilitate AI development across the enterprise.\n\n### Cisco launches AI Renewals Agent with Mistral AI\n\n_February 10, 2025:_ Cisco rolled out its first of many AI agents codeveloped with partner Mistral AI, a genAI and large language model (LLM) startup. The so-called AI Renewals Agent is an on-premise, AI-based application that Cisco’s internal Customer Experience (CX) group will use to help retain and renew customers more quickly.\n\n### Cisco’s ISE bugs could allow root-level command execution\n\n_February 7, 2025:_ Cisco is warning enterprise admins of two critical flaws within its identity and access management (IAM) solution, Identity Services Engine (ISE), that could allow attackers to obtain unauthorized privileges and run arbitrary commands on affected systems.\n\n### Cisco researchers highlight emerging threats to AI models\n\n_February 4, 2025_: Cisco security researchers this week detailed a number of threats they are seeing from bad actors trying to attack the large language model, AI’s most common component. Being able to disguise and hide content from machine analysis or human oversight is likely to become a more important vector of attack against AI systems, according to Cisco..\n\n### Cisco touts ‘Internet of Agents’ for secure AI agent collaboration\n\n_January 30, 2025_: When AI agents begin to proliferate, a new, open structure will be needed so they can securely communicate and collaborate together to solve complex problems, suggests Cisco. To head off potential problems such as agent sprawl and fragmented infrastructure, Cisco’s advanced research outfit Outshift is proposing the “ Internet of Agents.”\n\n### Cisco patches antivirus decommissioning bug as exploit code surfaces\n\n_January 23, 2025:_ Cisco has patched a denial-of-service (DoS) vulnerability affecting its open-source antivirus software toolkit, ClamAV, which already has a proof-of-concept (PoC) exploit code available to the public.\n\n### Cisco CEO Robbins on AI: Pressure to deploy is real\n\n_January 22, 2025_: Interest in AI has exploded over the last two or three years, but enterprises are only just beginning to think about how they’re going to take advantage of it, Cisco CEO Chuck Robbins told the audience at the company’s recent AI Summit.\n\n### Cisco unveils AI Defense package\n\n_Jan. 15, 2025_: Cisco rolled out a service that promises to protect enterprise AI development projects with visibility, access control, threat defense, and other safeguards. The AI Defense package offers protection to enterprise customers developing AI applications across models and cloud services, according to Tom Gillis, senior vice president and general manager of Cisco’s security, data center, Internet and cloud infrastructure groups.\n\n### Cisco in 2025: Lots of hard work ahead\n\n_Jan. 8, 202_ 5: Cisco executed a fairly short list of technology rollouts in 2024 and made a surprising lack of major updates to its core networking portfolio, which might have contributed to the 23% decline in networking revenue. In 2025, Cisco needs to refocus on enterprise networking and make the data center an all-inclusive home for AI applications, industry watchers say. Security technologies must continue to be a priority as well.\n\n## Cisco in 2024: the highlights\n\n**Cisco grabs SnapAttack for threat detection**\n\n_Dec. 17, 2024_: Cisco is acquiring threat-detection startup SnapAttack for an undisclosed amount as it continues to expand its security portfolio. Established in 2001 by Booz Allen’s Dark Labs, SnapAttack is known for its threat detection and engineering technology, which melds threat intelligence, attack emulation, and behavioral analytics to help customers identify potential vulnerabilities and gaps in their networks, ideally before problems happen.\n\n**Cisco strengthens AWS integration to speed multicloud troubleshooting**\n\n_Dec. 5, 2024_: Cisco bolstered integrations between its own hybrid cloud offerings and AWS to improve visibility and help enterprise customers more accurately troubleshoot application availability issues across multicloud networks. The new network troubleshooting capabilities revolve around container security technology that Cisco gained in its acquisition of Isovalent and integrated into its infrastructure offerings.\n\n**Cisco, NTT Data partner to simplify private 5G connectivity**\n\n_Nov. 26, 2024_: Cisco and NTT Data extended their partnership to offer customers more streamlined options for deploying private 5G services for enterprise connectivity. The partnership ties Cisco’s networking technologies to NTT Data’s Transatel network.\n\n**Cisco: Pressure to deploy AI is up, but only 13% feel ready**\n\n_Nov. 20, 2024_: Pressure to implement AI plans is on the rise, but the readiness of enterprise networks to handle AI workloads has actually declined over the past year, according to Cisco’s AI Readiness Index.\n\n**Cisco amps up Splunk observability platform** _Nov. 14, 2024_: Updates to Cisco’s Splunk Observability portfolio include new features as well as tie-ins to Splunk AppDynamics to help IT teams unify visibility and improve performance troubleshooting across on-premises and cloud environments.\n\n**Cisco launches intelligent Wi-Fi 7 access points**\n\n_Nov. 14, 2024_: Cisco has taken the wraps off a pair of intelligent WiFi-7 access points and introduced a new way of licensing wireless gear across cloud, on-premises and hybrid networks.\n\n**Cisco IoT wireless access points hit by severe command injection flaw**\n\n_Nov. 7, 2024_: Cisco’s URWB hardware has been hit with a hard-to-ignore flaw that could allow attackers to hijack the access points’ web interface using a crafted HTTP request. Cisco said the issue affects three products: the Catalyst IW9165D Heavy Duty Access Points, the Catalyst IW9165E Rugged Access Points and Wireless Clients, and the Catalyst IW9167E Heavy Duty Access Points.\n\n**Cisco takes aim at developing quantum data center**\n\n_Oct. 31, 2024:_ Cisco Research recently hosted its Quantum Summit 2024 gathering that drew industry experts to discuss ongoing work focused on everything quantum from networking to security, but it was research being done in the quantum data center that garnered most of Cisco’s focus.\n\n**Cisco pumps up data center networking with AI, large workloads in mind**\n\n_Oct. 16, 2024_: Cisco is boosting network density for its data center switch and router portfolio as it works to deliver the infrastructure its customers need for AI workloads and high-performance computing. Specifically, Cisco is scaling up its Nexus 9000 data center switches and Series 8000 routers for AI-ready networking.\n\n**Cisco revamps key DevNet sandboxes**\n\n_Oct. 10, 2024_: Cisco has expanded its DevNet sandbox environments to make it easier for network professionals to test and develop applications for key enterprise networking technologies. The new and upgraded DevNet sandboxes are dedicated to Catalyst Center, CI/CD pipelines for infrastructure automation, and Meraki products.\n\n**Cisco layoffs hit California workers**\n\n_Sept. 20, 2024_: Cisco’s rolling layoffs are taking a toll on workers in California. According to the state’s Worker Adjustment and Retraining Notification (WARN) system, which mandates a 60-day notification of large-scale layoffs, 842 employees impacted by the vendor’s current restructuring plan will come from the San Jose-San Francisco area. There is also speculation – not confirmed by Cisco – that some of its headquarters buildings will be closed.\n\n**Cisco ties AppDynamics to Microsoft Azure for cloud application management**\n\n_Aug. 30, 2024_: Cisco is now offering its AppDynamics application management suite as part of Microsoft Azure cloud services. Through the integration with Azure, Cisco’s AppDynamics platform can manage the performance of applications, virtual machines and other resources hosted on Microsoft’s cloud platform.\n\n**Cisco snaps up AI security player Robust Intelligence**\n\n_Aug. 27, 2024_: Cisco announced plans to acquire Robust Intelligence, a security startup with a platform designed to protect AI models and data throughout the development-to-production lifecycle. It’s paying an undisclosed amount to acquire the company, which Cisco has previously invested in through its Cisco Investments portfolio.\n\n**Cisco to cut 7% of workforce, restructure product groups**\n\n_Aug. 14, 2024_: Cisco is cutting 6,000 jobs in its second round of layoffs this year and combining its networking, security and collaboration groups into one unit led by Jeetu Patel. Cisco wants to use this restructuring to pump more resources into three growth areas: AI networking, security and collaboration.\n\n**Cisco expected to follow Dell with layoff announcement: Report**\n\n_Aug. 09, 2024_: A round of layoff announcements at Dell and Cisco are a result of both companies currently losing core market share to new industry competitors: Arista Networks for Cisco, in their core networking business, and low-cost PC manufacturers like Acer for Dell, an analyst said.\n\n**Cisco: AI can help security challenges created by IT/OT integration**\n\n_July 31, 2024_: When companies increase IT/OT integration, they can simplify operations, boost security and streamline decision making, according to Cisco’s industrial networking research.\n\n**Cisco Talos analyzes attack chains, network ransomware tactics**\n\n_July 11, 2024_: Cisco’s Talos security intelligence group analyzed ransomware groups to identify common techniques and offer recommendations to help security team better protect their businesses.\n\n**Cisco adds heft to cybersecurity push with acquisitions, new talent**\n\n_July 09, 2024_: With new leadership, key acquisitions, and an AI-driven, platform-based vision, Cisco is betting big on security. Its dominance in networking and telecommunications products and services is well established, but its role in cybersecurity is less cemented.\n\n**Cisco debuts CCDE-AI Infrastructure certification**\n\n_June 07, 2024_: Cisco announced a new certification program it says will empower IT pros to design infrastructure for AI and machine learning. The company’s new Cisco Certified Design Expert (CCDE) AI Infrastructure certification is a vendor-agnostic, expert-level certification that will equip IT professionals with the ability to design modern AI/ML compute and networks now and as they evolve, says Par Merat, vice president of Cisco learning and certifications.\n\n**Cisco steps up observability play with Splunk tie-ins**\n\n_June 07, 2024_: Work has already begun to integrate Splunk, AppDynamics, and ThousandEyes as Cisco strengthens its observability lineup. At the recent Cisco Live event, execs from Cisco and Splunk detailed plans to create what they called a “unified observability experience” to help customers manage applications across on-premises, hybrid, and multi-cloud environments.\n\n**AI takes center stage at Cisco Live**\n\n_June 05, 2024_: Cisco put AI front and center at its Live event, touting new networking, management and security products. CEO Chuck Robbins says the AI evolution is coming on fast, like the cloud transition on steroids. “You’re probably trying to figure out use cases, if you are haven’t already, and how you can use it,” said Robbins in his keynote address.\n\n**Cisco gears up to capitalize on Splunk deal, AI revolution**\n\n_May 30, 2024_: Despite a recent rough patch, Cisco has growth opportunities on multiple fronts. Its strategy starts with the $28 billion acquisition of Splunk, a bold move that adds $4 billion in annual revenue to Cisco’s roughly $55 billion base. More importantly, it creates revenue-generating opportunities across a variety of fast-growing markets: security, observability, data analytics, AIOps, and genAI.\n\n**AT&T taps Cisco fixed 5G wireless gateways for WAN service**\n\n_May 30, 2024_: Cisco Meraki has rolled out 5G fixed wireless access gateways, and AT&T said it will use them to offer a new service for business branch offices. The new Meraki MG cellular MG52 and MG52E gateways fill out the high-end of Meraki’s cellular gateway family and offer 2 Gbps/300Mbp throughput – which is twice the throughput of current high-end MG offerings.\n\n**Cisco research highlights network complexity, security challenges**\n\n_May 22, 2024_: IT leaders need more help managing and securing their distributed networking environments, Cisco asserts in its Global Networking Trends Report. “Network architectures are more sophisticated, more complex, and spread across more multi-clouds and multi-vendors than ever. IT leaders are also besieged by rising cybersecurity risks, increased demand from new app and workload types, and vastly distributed workforces and infrastructures,” said Jonathan Davidson, executive vice president and general manager of Cisco networking.\n\n**Cisco, Nutanix strengthen joint HCI package**\n\n_May 16, 2024_: Last year, Cisco killed its Hyperflex platform and essentially turned over that business to Nutanix. Now, Cisco and Nutanix have significantly expanded their alliance with new management capabilities, AI components and networking extensions for their integrated hyperconverged infrastructure package.\n\n**Cisco adds AI features to AppDynamics On-Premises**\n\n_May 10, 2024_: A new virtual appliance for Cisco’s AppDynamics observability platform will give enterprise customers more deployment options as well as AI-driven capabilities for anomaly detection and root cause analysis, application security, and SAP monitoring.\n\n**AI features boost Cisco’s Panoptica application security software**\n\n_May 07, 2024_: Cisco has added a variety of new AI-based security features to its cloud-native security platform that promise to help customers more quickly spot and remediate threats. The features extend the vendor’s Panoptica platform, which is designed to secure cloud applications from development to deployment with a focus on protecting containerized, microservice applications running on platforms such as Kubernetes.\n\n**Cisco, Red Hat extend networking, AI integrations**\n\n_May 03, 2024_: Cisco and Red Hat are expanding their 15-year-old strategic partnership, this time to bolster networking, AI and cloud integrations. At the Red Hat Summit 2024, the two vendors will demonstrate how tightly integrating Cisco Application Centric Infrastructure (ACI) with Red Hat’s OpenShift can help customers improve their network operations.\n\n**Cisco-backed startup Corelight raises $150 million**\n\n_May 02, 2024_: Cisco is part of a group that backed security startup Corelight with $150 million in Series E funding. The new funding will enable Corelight to further develop its technology, which transforms network and cloud activity as well as packet capture into evidence that security teams use to proactively hunt for threats, accelerate response to incidents, gain network visibility, and create powerful analytics results, according to the startup.\n\n**Cisco marries AI and security with cloud-based data center offering**\n\n_April 18, 2024_: Cisco announces AI-based Hypershield, a self-upgrading security fabric that’s designed to protect distributed applications, devices and data.\n\n**Cisco: AI networking adds to data center sustainability challenges**\n\n_April 03, 2024_: Data centers are notorious energy hogs, and the increase in heavy-duty networking and compute power required to handle AI workloads is only going to exacerbate the sustainability issue. But there are efforts underway to address the growth of AI and ML in data centers while keeping energy efficiency, cooling and performance in mind.\n\n**Beware the gap between security readiness and confidence levels, Cisco warns**\n\n_March 27, 2024_: Security readiness among enterprises has dropped in the past year, while the confidence level of many organizations is up. This disparity between confidence levels and security readiness suggests that companies may be overestimating their ability to navigate the threat landscape, Cisco reports in its newly released Cybersecurity Readiness Index.\n\n**Cisco: AI tools, better workspaces would boost in-office appeal**\n\n_March 27, 2024_: Cisco released its hybrid work study and found 72% of employees are positive about returning to the office, but they want better-equipped workspaces and more modern collaboration technologies. Office spaces at many companies are too focused on individual work rather than structured around spaces that can encourage collaboration, social interaction and creative brainstorming, according to the survey, which polled 14,050 employees and 3,800 employers in 19 countries worldwide.\n\n**Cisco taps former Microsoft, Broadcom exec**\n\n_March 25, 2024_: Martin Lund will lead the group responsible for delivering the silicon, optics, and hardware for Cisco’s core switching, routing, and wireless offerings.\n\n**Cisco, Intel expand Wi-Fi 7 partnership**\n\n_March 21, 2024_: Joint development work by Cisco and Intel is aimed at delivering more reliable Wi-Fi connectivity and new capabilities for latency-sensitive applications.\n\n**Cisco aims AI advancements at data center infrastructure**\n\n_March 20, 2024_: The Splunk buy and Cisco’s partnership with Nvidia are part of its efforts to build data-center network infrastructure for supporting AI/ML workloads.\n\n**Cisco completes $28 billion Splunk acquisition**\n\n_March 18, 2024_: Cisco closed its $28 billion acquisition of Splunk, promising product innovations across its security, observability and AI portfolios with the integration of Splunk. Network security teams can use Splunk’s technology to gain better visibility into network traffic, firewalls, intrusion detection systems, and SIEM systems.\n\n**Cisco Talos: 3 post-compromise tactics that threaten your network infrastructure**\n\n_March 07, 2024_: The bad actors who are perpetrating advanced persistent threat (APT) attacks aren’t just looking to access your network. They want to hang around to collect valuable data or lay plans for future attacks. Post-compromise threats are growing, Cisco says, and they’re aimed largely at aging network infrastructure and edge devices that are long past end-of-life stage and may have critical unpatched vulnerabilities. “… the older legacy components have more avenues for access, especially if the devices are out of support and they haven’t been updated in three or four years,” said Nick Biasini, head of outreach at Cisco’s Talos security research arm.\n\n**Cisco, partners to offer tailored IoT/OT packages**\n\n_Feb. 29, 2024_: Cisco has implemented a new blueprint that involves working more closely with partners to offer packages of networking and software components that meld IT elements with Internet of Things (IoT) and operational technology (OT).\n\n**Cisco to cut 5% of workforce amid restructuring; layoffs will impact 4,200 jobs**\n\n_Feb. 14, 2024_: After days of speculation, Cisco announced a restructuring plan that will see the networking vendor cut 5%, or about 4,200 jobs, from its 84,900 workforce as it plans to continue to focus on high-strength areas such as AI and security.\n\n**Cisco brings AI assistant to cloud app security service**\n\n_Feb. 08, 2024_: Cisco is launching a generative AI-based assistant to help customers handle cloud-native application security issues more quickly and efficiently. The Cisco AI Assistant for Panoptica will help businesses streamline, prioritize, and remediate risks and misconfigurations in multi-cloud environments, according to Vijoy Pandey, senior vice president of Cisco’s Outshift advanced development group.\n\n**Cisco launches Motific hub to streamline generative AI deployment**\n\n_Feb. 07, 2024_: Cisco is delivering a cloud-based service that gives enterprise customers a centralized hub for managing AI elements. Called Motific, the service promises to help streamline and accelerate the creation, deployment and management of generative AI-based applications for the enterprise.\n\n**Cisco, Nvidia target secure AI with expanded partnership**\n\n_Feb. 06, 2024_: Cisco and Nvidia have expanded their partnership to offer integrated software and networking hardware that promises to help customers more easily spin up infrastructure to support AI applications. The agreement deepens both companies’ strategy to expand the role of Ethernet networking for AI workloads in the enterprise. It also gives both companies access to each other’s sales and support systems.\n\n**Cisco, Hitachi deliver managed hybrid cloud services**\n\n_Jan. 31, 2024_: Cisco and Hitachi Vantara have unveiled the first fruits of their partnership, signed last year, that aims to bring managed as-a-service offerings to enterprise customers with hybrid cloud environments. The joint offering, Hitachi EverFlex with Cisco Powered Hybrid Cloud, includes a range of converged infrastructure services that meld compute, networking and software technologies from Cisco and storage capabilities from Hitachi.\n\n**Cisco looks to ease management of software agents**\n\n_Jan. 26, 2024_: Cisco AppDynamics rolled out a new management product that aims to take the pressure off operations teams tasked with maintaining a growing raft of application and infrastructure agents. Smart Agent for Cisco AppDynamics can help customers spot and update out-of-date software agents as well as quickly on-board and manage new agents through a centralized user interface, Cisco stated.\n\n**Cisco brings SSE technology to new Kyndryl services**\n\n_Jan. 25, 2024_: Kyndryl’s new managed services incorporate Cisco’s Secure Access platform, which includes zero-trust network access, secure web gateway, and firewall as a service.\n\n**Cisco, T-Mobile team to offer managed 5G service**\n\n_Jan. 24, 2024_: Cisco and T-Mobile have teamed to offer a managed 5G-based connectivity service for remote branches and small offices. The T-Mobile-managed package, called Connected Workplace, will make use of Cisco Meraki 5G cellular gateways as well as its network and visibility management platform. The Meraki software includes cloud-managed security features and a central Meraki dashboard for network management support. Together with T-Mobile’s unlimited nationwide business internet service, the offering will allow organizations to network everything from end users and IoT devices to point-of-sale systems and video installations.\n\n**Cisco sees headway in quantum networking, but advances are slow**\n\nJan. 22, 2024: While core quantum networking technologies such as repeaters and photonics are being developed, it is security applications that are likely to be the first real-world developments that come out of the lab, according to Liz Centoni, executive vice president, chief strategy officer and general manager of applications at Cisco.\n\n**Cisco buy highlights container networking, security**\n\n_Jan. 17, 2024_: Cisco’s acquisition of startup Isovalent, developer of open-source tools Cilium and Tetragon, underscores the potential of the popular eBPF kernel technology for multicloud networking and security.\n\nSUBSCRIBE TO OUR NEWSLETTER\n\n### From our editors straight to your inbox\n\nGet started by entering your email address below.\n\nPlease enter a valid email address\n\nSubscribe\n\n## Show me more\n\nPopularArticlesPodcastsVideos\n\nnews\\\\\n\\\\\n**Intel sees supply shortage, will prioritize data center technology** \\\\\n\\\\\nBy Andy Patrizio\\\\\n\\\\\nOct 24, 20253 mins\\\\\n\\\\\nCPUs and ProcessorsData Center\\\\\n\\\\\nImage\n\nnews\\\\\n\\\\\n**Anthropic signs billion-dollar deal with Google Cloud** \\\\\n\\\\\nBy Mikael Markander\\\\\n\\\\\nOct 24, 20252 mins\\\\\n\\\\\nArtificial IntelligenceCloud ComputingGenerative AI\\\\\n\\\\\nImage\n\nnews analysis\\\\\n\\\\\n**How Patmos set up an AI data center in 90 days** \\\\\n\\\\\nBy Andy Patrizio\\\\\n\\\\\nOct 23, 20254 mins\\\\\n\\\\\nArtificial IntelligenceData Center DesignData Center Management\\\\\n\\\\\nImage\n\npodcast\\\\\n\\\\\n**Has the hype around ‘Internet of Things’ paid off? \\| Ep. 145** \\\\\n\\\\\nApr 18, 202436 mins\\\\\n\\\\\nIoT PlatformsIoT Security\\\\\n\\\\\nImage\n\npodcast\\\\\n\\\\\n**Episode 1: Understanding Cisco’s Converged SDN Transport** \\\\\n\\\\\nSep 24, 202120 mins\\\\\n\\\\\nCisco SystemsInternetNetworking\\\\\n\\\\\nImage\n\npodcast\\\\\n\\\\\n**Episode 2: Pluggable Optics and the Internet for the Future** \\\\\n\\\\\nSep 23, 202117 mins\\\\\n\\\\\nCisco SystemsComputers and PeripheralsInternet\\\\\n\\\\\nImage\n\nvideo\\\\\n\\\\\n**Master Linux Math with the bc Command \\| Easy CLI Calculations Explained!** \\\\\n\\\\\nJun 23, 20251 mins\\\\\n\\\\\nOperating Systems\\\\\n\\\\\nImage\n\nvideo\\\\\n\\\\\n**Master Linux Math in Seconds: How to Use the expr Command Like a Pro** \\\\\n\\\\\nJun 17, 20251 mins\\\\\n\\\\\nOperating Systems\\\\\n\\\\\nImage\n\nvideo\\\\\n\\\\\n**How to Do Math in the Command Line Using Double Parentheses** \\\\\n\\\\\nJun 6, 20251 mins\\\\\n\\\\\nOperating Systems\\\\\n\\\\\nImage",
      "html": "",
      "metadata": {
        "title": "Cisco: Latest news and insights | Network World",
        "description": "Here’s what you need to know about the networking giant’s latest product and company news.",
        "language": "en",
        "sourceURL": "https://networkworld.com/article/3523958/cisco-latest-news-and-insights.html"
      },
      "content_type": "news",
      "success": true,
      "error": null,
      "scraped_at": "2025-10-24T10:47:42.920167",
      "processed_markdown": "by Network World staff\n# Cisco: Latest news and insights\nNews\nOct 17, 202532 mins\nNetwork Management SoftwareNetwork SecurityNetworking\n## Here’s what you need to know about the networking giant’s latest product and company news.\nCisco logo and font on dark background. 3D render.\nCredit: CryptoFX /Shutterstock\nCisco ( Nasdaq:CSCO) is the dominant vendor in enterprise networking, and under CEO Chuck Robbins, it continues to shake things up.\nCisco is focusing on strategic AI initiatives and partnerships across various regions to build and power AI data centers and ecosystems. This includes collaborations with major players like BlackRock, Global Infrastructure Partners, Microsoft and Nvidia to drive investment and scale AI infrastructure.\nThe networking giant continues to focus on integrating AI into its security offerings, with announcements around Cisco Secure AI Factory with Nvida, which aims to embed security into all layers of AI infrastructure.\n## Cisco news and analysis\n### ‘Zero Disco’ campaign hits legacy Cisco switches with fileless rootkit payloads\n_October 17, 2025_: In newly disclosed real-world attacks, threat actors are found exploiting a Cisco SNMP vulnerability to gain remote code execution (RCE) and install Linux rootkits on vulnerable switches.\n### Cisco seriously amps-up Silicon One chip, router for AI data center connectivity\n_October 8, 2025_: Cisco has unwrapped a high-end, 51.2 Tbps router and chip that it says will go a long way toward supporting the distributed AI data center workloads of today and in the future.\n### Cisco: AI demands more reliable optical networking components\n_October 3, 2025_: As AI networking environments become more dependent on optical networking components, enterprises need to pay close attention to the reliability of high-speed optics, Cisco warns.\n### Cisco admins urged to patch IOS, IOS XE devices\n_September 25, 2025_: Network admins should quickly patch a vulnerability in Cisco Systems IOS and IOS XE software to remove a stack overflow condition in the software’s Simple Network Management Protocol (SNMP) subsystem or risk nasty attacks, say experts.\n### Cisco expands its quantum networking portfolio with new software prototypes\n_September 25, 2025_: Cisco announced a package of prototype software it says will facilitate distributed quantum computing networks and support real-time applications. Essentially, the software enables distributed quantum computing in the quantum data center.\n### Cisco’s Splunk embeds agentic AI into security and observability products\n_September 9, 2025_: Cisco unveiled agentic AI-powered security and observability capabilities built to automate threat response, streamline IT operations, and manage complex environments. Splunk Enterprise Security Premier and Splunk Enterprise Security Essentials are designed to unify security workflows across threat detection, investigation, and response.\n### Cisco launches AI-driven data fabric powered by Splunk\n_September 8, 2025_: Cisco unveiled a new data architecture that’s powered by the Splunk platform and designed to help enterprises glean AI-driven insights from machine-generated telemetry, such as metrics, events, logs and traces.\n### Cisco launches dedicated wireless certification track\n_August 27, 2025_: Cisco is introducing a new wireless certification track in response to demand for specialized wireless expertise. The Cisco Certified Network Professional (CCNP) Wireless and Cisco Certified Internetwork Expert Enterprise (CCIE) Wireless certifications will replace the CCNP Enterprise wireless concentration. CCNP Enterprise will continue to focus on routing, switching, SD-WAN, security, automation, cloud connectivity, and virtualization.\n### Russian hackers exploit old Cisco flaw to target global enterprise networks\n_August 21, 2025:_ Russian state-sponsored cyber actors linked to the Federal Security Service (FSB) conducted a decade-long espionage campaign that compromised thousands of enterprise network devices across critical sectors worldwide, according to an FBI advisory. The threat actor, designated “Static Tundra” by Cisco Talos and previously known as “Berserk Bear” and “Dragonfly,” systematically exploited CVE-2018-0171, a six-year-old vulnerability in Cisco Smart Install (SMI), to gain deep access to enterprise network infrastructure and conduct reconnaissance on industrial control systems.\n### Cisco ties storage networking gear to IBM z17 mainframe\n_August 20, 2025:_ Cisco said its MDS 9000 Series multilayer switches, including the MDS 9148V switch, have been tested and validated for compatibility with IBM z17 mainframe environments. This latest generation of IBM mainframe features new AI acceleration technologies as well as improved management for hybrid cloud applications, encryption and threat detection, and integrated and simplified programming capabilities.\n### Warning: Patch this hole in Cisco Secure FMC fast\n_August 15, 2025:_ Admins using Cisco Systems Secure Firewall Management Center (FMC) Software for network login authentication are being warned to quickly patch a major vulnerability that could allow a remote attacker to breach security. At risk are deployments configured for RADIUS authentication for the web-based management interface, SSH management, or both, Cisco said in its alert.\n### Cisco Q4 results: AI infrastructure orders surpass goal\n_August 14, 2025_: Cisco is seeing significant AI infrastructure demand and expects that growth to continue into next year, executives said as the company wrapped up its 2025 fiscal year.\n### Cisco strengthens AI networking story\n_August 13, 2025_: Network infrastructure is described as the plumbing of the internet, with Cisco chief among the providers. As the AI era unfolds and that plumbing needs modernizing, Cisco is vying to secure its role as a key AI infrastructure provider across enterprise and hyperscaler networking environments.\n### Cisco teams with Hugging Face for AI model anti-malware\n_August 5, 2025:_ The Foundation AI team at Cisco teamed with AI model hub Hugging Face to bolster malware protection and strengthen security across the AI ecosystem.\n### Cisco warns of another critical RCE flaw in ISE, urges immediate patching\n_July 18, 2025_: Cisco dropped another maximum severity advisory detailing an unauthenticated remote code execution (RCE) flaw in its Identity Services Engine (ISE) and ISE Passive Identity Connector (ISE-PIC).\n### Cisco upgrades 400G optical receiver to boost AI infrastructure throughput\n_July 17, 2025_: Cisco unveiled a new optical receiver that lets data center customers better support AI and other high-throughput applications. The 400G bidirectional (BiDi) optical transceiver allows customers to upgrade to higher throughput without tearing out existing fiber\n### Hardcoded root credentials in Cisco Unified CM trigger max-severity alert\n_July 3, 2025:_ Cisco has patched a max severity flaw in its Unified Communications Manager (Unified CM) and Session Management Edition (Unified CM SME) products that could let attackers walk right in using a hardcoded root login.\n### Cisco warns of critical API vulnerabilities in ISE and ISE-PIC\n_June 26, 2025:_ Companies are being urged to quickly patch multiple vulnerabilities in Cisco Systems Identity Services Engine (ISE) and Cisco ISE Passive Identity Connector (ISE-PIC) that could allow an unauthenticated, remote attacker to issue commands on the underlying operating system as the _root_ user.\n### Cisco CIO on the future of IT: AI, simplicity, and employee power\n_June 26, 2025:_ As Cisco infuses its enterprise infrastructure products with AI, the technology is also infiltrating its internal platforms, directed by Cisco CIO Fletcher Previn. His focus is on developing and using AI tools that can change how Cisco and its employees do business.\n### Cisco backs quantum networking startup Qunnect\n_June 24, 2025_: Cisco Investments is backing Qunnect, a network hardware company that has designs on building quantum communication systems using existing telecom fiber.\n### Cisco capitalizes on Isovalent buy, unveils new load balancer\n_June 16, 2025_: Since it acquired open-source software developer Isovalent in 2024, Cisco has been busy integrating its technology into some core products. In particular, Cisco has elevated the use of Isovalent’s core container communications technology, Kubernetes-native networking and security platform eBPF (extended Berkeley Packet Filter).\n### Cisco underscores AI commitment with networking LLM, agentic AI interface\n_June 12, 2025_: A wide range of new AI-based software and technology from Cisco is designed to manage, secure and automate network operations as well as to cement Cisco’s place at the center of customers’ AI infrastructure plans. Cisco rolled out the new wares at its Cisco Live event.\n### At Cisco Live, it’s all about AI for networking and security\n_June 11, 2025:_ Cisco Live focused on two aspects: AI being used to make Cisco technology smarter and easier to use, and Cisco innovations that will enable customers to adopt AI. An easy way to consider the two buckets is “AI for Cisco” and “Cisco for AI.”\n### Cisco Live: Security focus yields new firewalls, Hypershield integrations, and agentic AI defenses\n_June 11, 2025:_ At its Cisco Live event, the vendor rolled out a new Hybrid Mesh Firewall portfolio, bolstered security support with partner Nvidia, and further tightened its own technology integration with its Splunk platform. The announcements share a common goal of protecting all things AI – workloads, inferencing, models and more – as Cisco works to secure the core infrastructure that supports the AI build-out.\n### Cisco reinvigorates data center, campus, branch networking with AI demands in mind\n_June 10, 2025:_ Cisco has upgraded critical components of its network family – including switches, routers and software for data center, campus, branch and IoT – in a major effort to deliver the growing capacity and management capabilities its enterprise customers will need for AI environments.\n### Cisco Live: AI will bring developer workflow closer to the network\n_June 10, 2025:_ AI is reshaping networking in ways that demand a new degree of programmability, observability, and optimization, Cisco CEO Chuck Robbins said. And if history is any guide, what starts as an infrastructure concern for network and platform teams will eventually trickle down to developers.\n### Cisco Wireless LAN Controllers under threat again after critical exploit details go public\n_June 3, 2025:_ The heat is back on Wireless LAN Controllers (WLCs) running Cisco IOS XE after technical details of a recently disclosed max-severity exploit were made public.\n### Cisco bolsters DNS security package\n_May 29, 2025_: Cisco has bulked-up its Domain Name System (DNS) security software with new features including AI-enhanced DNS tunneling mitigation and stronger cloud malware detection. Cisco Secure Access – DNS Defense replaces the current Cisco Umbrella DNS Essentials and Advantage packages and enhances those offerings.\n### Cisco taps OpenAI’s Codex for AI-driven network coding\n_May 16, 2025_: Cisco is working with OpenAI and its Codex software engineering agent to give network engineers access to better tools for writing, testing and building code. The AI coding agen t is available via ChatGPT and can navigate a codebase, implement and test code changes, and propose pull requests for review, according to Cisco.\n### Cisco joins AI infrastructure alliance\n_May 13, 2025_: Cisco joinied a group led by BlackRock, Microsoft and Nvidia to develop secure and scalable infrastructure to support AI workloads. The AI Infrastructure Partnership (AIP) includes investors, asset owners, and corporations with plans to raise up to $30 billion for the development of data centers for artificial intelligence and the energy infrastructure to power them.\n### Cisco patches max-severity flaw allowing arbitrary command execution\n_May 9, 2025:_ Cisco is urging customers to patch for a maximum-severity flaw affecting its IOS XE Software for Wireless controllers. The flaw, tracked as CVE-2025-20188, received a severity rating of CVSS 10/10 because of its high exploitability and the ability to allow arbitrary command execution.\n### Cisco unveils prototype quantum networking chip\n_May 6. 2025:_ Cisco is developing a quantum entanglement chip that could ultimately become part of the gear that will populate future quantum data centers.\n### Cisco automates AI-driven security across enterprise networks\n_April 28, 2025_: Cisco announced a range of AI-driven security enhancements, including improved threat detection and response capabilities in Cisco XDR and Splunk Security, new AI agents, and integration between Cisco’s AI Defense platform and ServiceNow SecOps.\n### Cisco SVP talks agentic AI, quantum security and sustainable infrastructure\n_Aprill 14, 2025_: Cisco is building AI capabilities across its portfolio, including collaboration, observability, security, and network software, to help customers more effectively tackle challenges such as employee productivity and digital resilience.\n### Cisco GM underscores focus on issues critical for Spain’s tech development\n_April 10, 2025:_ Cisco recently celebrated its 40 anniversary, and its mission to connect the world remains intact. It’s focused on critical areas such as AI and cybersecurity that have worldwide relevance, including in Spain, where Cisco has more than three decades of history, says Andreu Vilamitjana, general manager of Cisco in Iberia, who spoke recently at the company’s Engage event in Madrid.\n### Cisco, Google Cloud offer enterprises new way to connect SD-WANs\n_Apriil 9, 2025_: Cisco and Google Cloud have expanded their partnership to integrate Cisco’s SD-WAN with the cloud provider’s fully managed Cloud WAN service. For Cisco SD-WAN customers, the integration provides a new, secure way to tie together geographically dispersed enterprise data center sites with their Google Cloud workloads using Google’s core global network backbone.\n### Cisco takes inspiration from Iron Man for its AI-driven platform engineer\nApril 2, 2025: When it comes to developing highly intelligent AI agents, you might not think of combining open systems technology and the theoretical super-logic behind a movie character, but Cisco’s Outshift development team is doing just that. To address the complexity of platform and infrastructure engineering, Cisco is drawing inspiration from the “Iron Man” superhero franchise.\n### Cisco, Nvidia team to deliver secure AI factory infrastructure\nMarch 18, 2025: Cisco and Nvidia have expanded their partnership to create their most advanced AI architecture package to date, designed to promote secure enterprise AI networking. The Cisco Secure AI Factory with Nvidia brings together Cisco security and networking technology, Nvidia DPUs, and storage options from multiple vendors.\n### Jio teams with AMD, Cisco and Nokia to build AI-enabled telecom platform\n_March 18. 2025_: Initiative led by Jio Platforms Limited will combine AMD’s computing solutions, Cisco’s networking and security, and Nokia’s RAN and core technologies.\n### Cisco’s AI agents for WebEx aim to improve customer service\n_Mar 17, 2025:_ Cisco is adding new features to its Webex collaboration tool as it expands its adoption of agentic AI.\n### Cisco CIO Fletcher Previn talks culture: ‘They can steal your technology, but not your philosophy’\n_February 26, 2025_: In an interview with _CIO Spain_, Fletcher Previn, Cisco’s CIO, discussed Cisco’s roadmap, discussed AI regulations, advocated for balance among legislation, innovation and risk, and revealed how he approaches shadow IT in his own organization.\n### 5 takeaways from Cisco Live EMEA\n_February 26, 2025_:  To no one’s surprise, the primary theme at Cisco Live EMEA was AI and how it will change the way we live. And, more importantly, how AI will forever alter how IT pros deploy and operate our IT environments.\n### Cisco, Nvidia expand AI partnership to include Silicon One technology\n_February 25. 2025_: Nvidia will couple Cisco Silicon One technology with Nvidia SuperNICs as part of its Spectrum-X Ethernet networking platform, and Cisco will build systems that combine Nvidia Spectrum silicon with Cisco OS software.\n### Cisco financials catch AI demand, enterprise networking growth\n_February 13, 2025_: Cisco executives were upbeat about the growth in AI orders — $700 million so far this year, on way to surpass $1 billion in 2025 – as the networking giant detailed a successful 2Q earnings period this week to Wall Street.\n### Cisco doubles down on AI with new, updated certifications\n_February 11, 2025_: Cisco this week furthered its commitment to help customers support and develop artificial intelligence systems by rolling out new AI certification and training courses aimed at teaching professionals everything from how to incorporate AI into specific roles to advanced networking design.\n### Cisco data center switches feature baked-in security for AI, networking duties\n_February 11, 2025_: Cisco has unwrapped a new family of data center switches it says will help customers more securely support large workloads and facilitate AI development across the enterprise.\n### Cisco launches AI Renewals Agent with Mistral AI\n_February 10, 2025:_ Cisco rolled out its first of many AI agents codeveloped with partner Mistral AI, a genAI and large language model (LLM) startup. The so-called AI Renewals Agent is an on-premise, AI-based application that Cisco’s internal Customer Experience (CX) group will use to help retain and renew customers more quickly.\n### Cisco’s ISE bugs could allow root-level command execution\n_February 7, 2025:_ Cisco is warning enterprise admins of two critical flaws within its identity and access management (IAM) solution, Identity Services Engine (ISE), that could allow attackers to obtain unauthorized privileges and run arbitrary commands on affected systems.\n### Cisco researchers highlight emerging threats to AI models\n_February 4, 2025_: Cisco security researchers this week detailed a number of threats they are seeing from bad actors trying to attack the large language model, AI’s most common component. Being able to disguise and hide content from machine analysis or human oversight is likely to become a more important vector of attack against AI systems, according to Cisco..\n### Cisco touts ‘Internet of Agents’ for secure AI agent collaboration\n_January 30, 2025_: When AI agents begin to proliferate, a new, open structure will be needed so they can securely communicate and collaborate together to solve complex problems, suggests Cisco. To head off potential problems such as agent sprawl and fragmented infrastructure, Cisco’s advanced research outfit Outshift is proposing the “ Internet of Agents.”\n### Cisco patches antivirus decommissioning bug as exploit code surfaces\n_January 23, 2025:_ Cisco has patched a denial-of-service (DoS) vulnerability affecting its open-source antivirus software toolkit, ClamAV, which already has a proof-of-concept (PoC) exploit code available to the public.\n### Cisco CEO Robbins on AI: Pressure to deploy is real\n_January 22, 2025_: Interest in AI has exploded over the last two or three years, but enterprises are only just beginning to think about how they’re going to take advantage of it, Cisco CEO Chuck Robbins told the audience at the company’s recent AI Summit.\n### Cisco unveils AI Defense package\n_Jan. 15, 2025_: Cisco rolled out a service that promises to protect enterprise AI development projects with visibility, access control, threat defense, and other safeguards. The AI Defense package offers protection to enterprise customers developing AI applications across models and cloud services, according to Tom Gillis, senior vice president and general manager of Cisco’s security, data center, Internet and cloud infrastructure groups.\n### Cisco in 2025: Lots of hard work ahead\n_Jan. 8, 202_ 5: Cisco executed a fairly short list of technology rollouts in 2024 and made a surprising lack of major updates to its core networking portfolio, which might have contributed to the 23% decline in networking revenue. In 2025, Cisco needs to refocus on enterprise networking and make the data center an all-inclusive home for AI applications, industry watchers say. Security technologies must continue to be a priority as well.\n## Cisco in 2024: the highlights\n**Cisco grabs SnapAttack for threat detection**\n_Dec. 17, 2024_: Cisco is acquiring threat-detection startup SnapAttack for an undisclosed amount as it continues to expand its security portfolio. Established in 2001 by Booz Allen’s Dark Labs, SnapAttack is known for its threat detection and engineering technology, which melds threat intelligence, attack emulation, and behavioral analytics to help customers identify potential vulnerabilities and gaps in their networks, ideally before problems happen.\n**Cisco strengthens AWS integration to speed multicloud troubleshooting**\n_Dec. 5, 2024_: Cisco bolstered integrations between its own hybrid cloud offerings and AWS to improve visibility and help enterprise customers more accurately troubleshoot application availability issues across multicloud networks. The new network troubleshooting capabilities revolve around container security technology that Cisco gained in its acquisition of Isovalent and integrated into its infrastructure offerings.\n**Cisco, NTT Data partner to simplify private 5G connectivity**\n_Nov. 26, 2024_: Cisco and NTT Data extended their partnership to offer customers more streamlined options for deploying private 5G services for enterprise connectivity. The partnership ties Cisco’s networking technologies to NTT Data’s Transatel network.\n**Cisco: Pressure to deploy AI is up, but only 13% feel ready**\n_Nov. 20, 2024_: Pressure to implement AI plans is on the rise, but the readiness of enterprise networks to handle AI workloads has actually declined over the past year, according to Cisco’s AI Readiness Index.\n**Cisco amps up Splunk observability platform** _Nov. 14, 2024_: Updates to Cisco’s Splunk Observability portfolio include new features as well as tie-ins to Splunk AppDynamics to help IT teams unify visibility and improve performance troubleshooting across on-premises and cloud environments.\n**Cisco launches intelligent Wi-Fi 7 access points**\n_Nov. 14, 2024_: Cisco has taken the wraps off a pair of intelligent WiFi-7 access points and introduced a new way of licensing wireless gear across cloud, on-premises and hybrid networks.\n**Cisco IoT wireless access points hit by severe command injection flaw**\n_Nov. 7, 2024_: Cisco’s URWB hardware has been hit with a hard-to-ignore flaw that could allow attackers to hijack the access points’ web interface using a crafted HTTP request. Cisco said the issue affects three products: the Catalyst IW9165D Heavy Duty Access Points, the Catalyst IW9165E Rugged Access Points and Wireless Clients, and the Catalyst IW9167E Heavy Duty Access Points.\n**Cisco takes aim at developing quantum data center**\n_Oct. 31, 2024:_ Cisco Research recently hosted its Quantum Summit 2024 gathering that drew industry experts to discuss ongoing work focused on everything quantum from networking to security, but it was research being done in the quantum data center that garnered most of Cisco’s focus.\n**Cisco pumps up data center networking with AI, large workloads in mind**\n_Oct. 16, 2024_: Cisco is boosting network density for its data center switch and router portfolio as it works to deliver the infrastructure its customers need for AI workloads and high-performance computing. Specifically, Cisco is scaling up its Nexus 9000 data center switches and Series 8000 routers for AI-ready networking.\n**Cisco revamps key DevNet sandboxes**\n_Oct. 10, 2024_: Cisco has expanded its DevNet sandbox environments to make it easier for network professionals to test and develop applications for key enterprise networking technologies. The new and upgraded DevNet sandboxes are dedicated to Catalyst Center, CI/CD pipelines for infrastructure automation, and Meraki products.\n**Cisco layoffs hit California workers**\n_Sept. 20, 2024_: Cisco’s rolling layoffs are taking a toll on workers in California. According to the state’s Worker Adjustment and Retraining Notification (WARN) system, which mandates a 60-day notification of large-scale layoffs, 842 employees impacted by the vendor’s current restructuring plan will come from the San Jose-San Francisco area. There is also speculation – not confirmed by Cisco – that some of its headquarters buildings will be closed.\n**Cisco ties AppDynamics to Microsoft Azure for cloud application management**\n_Aug. 30, 2024_: Cisco is now offering its AppDynamics application management suite as part of Microsoft Azure cloud services. Through the integration with Azure, Cisco’s AppDynamics platform can manage the performance of applications, virtual machines and other resources hosted on Microsoft’s cloud platform.\n**Cisco snaps up AI security player Robust Intelligence**\n_Aug. 27, 2024_: Cisco announced plans to acquire Robust Intelligence, a security startup with a platform designed to protect AI models and data throughout the development-to-production lifecycle. It’s paying an undisclosed amount to acquire the company, which Cisco has previously invested in through its Cisco Investments portfolio.\n**Cisco to cut 7% of workforce, restructure product groups**\n_Aug. 14, 2024_: Cisco is cutting 6,000 jobs in its second round of layoffs this year and combining its networking, security and collaboration groups into one unit led by Jeetu Patel. Cisco wants to use this restructuring to pump more resources into three growth areas: AI networking, security and collaboration.\n**Cisco expected to follow Dell with layoff announcement: Report**\n_Aug. 09, 2024_: A round of layoff announcements at Dell and Cisco are a result of both companies currently losing core market share to new industry competitors: Arista Networks for Cisco, in their core networking business, and low-cost PC manufacturers like Acer for Dell, an analyst said.\n**Cisco: AI can help security challenges created by IT/OT integration**\n_July 31, 2024_: When companies increase IT/OT integration, they can simplify operations, boost security and streamline decision making, according to Cisco’s industrial networking research.\n**Cisco Talos analyzes attack chains, network ransomware tactics**\n_July 11, 2024_: Cisco’s Talos security intelligence group analyzed ransomware groups to identify common techniques and offer recommendations to help security team better protect their businesses.\n**Cisco adds heft to cybersecurity push with acquisitions, new talent**\n_July 09, 2024_: With new leadership, key acquisitions, and an AI-driven, platform-based vision, Cisco is betting big on security. Its dominance in networking and telecommunications products and services is well established, but its role in cybersecurity is less cemented.\n**Cisco debuts CCDE-AI Infrastructure certification**\n_June 07, 2024_: Cisco announced a new certification program it says will empower IT pros to design infrastructure for AI and machine learning. The company’s new Cisco Certified Design Expert (CCDE) AI Infrastructure certification is a vendor-agnostic, expert-level certification that will equip IT professionals with the ability to design modern AI/ML compute and networks now and as they evolve, says Par Merat, vice president of Cisco learning and certifications.\n**Cisco steps up observability play with Splunk tie-ins**\n_June 07, 2024_: Work has already begun to integrate Splunk, AppDynamics, and ThousandEyes as Cisco strengthens its observability lineup. At the recent Cisco Live event, execs from Cisco and Splunk detailed plans to create what they called a “unified observability experience” to help customers manage applications across on-premises, hybrid, and multi-cloud environments.\n**AI takes center stage at Cisco Live**\n_June 05, 2024_: Cisco put AI front and center at its Live event, touting new networking, management and security products. CEO Chuck Robbins says the AI evolution is coming on fast, like the cloud transition on steroids. “You’re probably trying to figure out use cases, if you are haven’t already, and how you can use it,” said Robbins in his keynote address.\n**Cisco gears up to capitalize on Splunk deal, AI revolution**\n_May 30, 2024_: Despite a recent rough patch, Cisco has growth opportunities on multiple fronts. Its strategy starts with the $28 billion acquisition of Splunk, a bold move that adds $4 billion in annual revenue to Cisco’s roughly $55 billion base. More importantly, it creates revenue-generating opportunities across a variety of fast-growing markets: security, observability, data analytics, AIOps, and genAI.\n**AT&T taps Cisco fixed 5G wireless gateways for WAN service**\n_May 30, 2024_: Cisco Meraki has rolled out 5G fixed wireless access gateways, and AT&T said it will use them to offer a new service for business branch offices. The new Meraki MG cellular MG52 and MG52E gateways fill out the high-end of Meraki’s cellular gateway family and offer 2 Gbps/300Mbp throughput – which is twice the throughput of current high-end MG offerings.\n**Cisco research highlights network complexity, security challenges**\n_May 22, 2024_: IT leaders need more help managing and securing their distributed networking environments, Cisco asserts in its Global Networking Trends Report. “Network architectures are more sophisticated, more complex, and spread across more multi-clouds and multi-vendors than ever. IT leaders are also besieged by rising cybersecurity risks, increased demand from new app and workload types, and vastly distributed workforces and infrastructures,” said Jonathan Davidson, executive vice president and general manager of Cisco networking.\n**Cisco, Nutanix strengthen joint HCI package**\n_May 16, 2024_: Last year, Cisco killed its Hyperflex platform and essentially turned over that business to Nutanix. Now, Cisco and Nutanix have significantly expanded their alliance with new management capabilities, AI components and networking extensions for their integrated hyperconverged infrastructure package.\n**Cisco adds AI features to AppDynamics On-Premises**\n_May 10, 2024_: A new virtual appliance for Cisco’s AppDynamics observability platform will give enterprise customers more deployment options as well as AI-driven capabilities for anomaly detection and root cause analysis, application security, and SAP monitoring.\n**AI features boost Cisco’s Panoptica application security software**\n_May 07, 2024_: Cisco has added a variety of new AI-based security features to its cloud-native security platform that promise to help customers more quickly spot and remediate threats. The features extend the vendor’s Panoptica platform, which is designed to secure cloud applications from development to deployment with a focus on protecting containerized, microservice applications running on platforms such as Kubernetes.\n**Cisco, Red Hat extend networking, AI integrations**\n_May 03, 2024_: Cisco and Red Hat are expanding their 15-year-old strategic partnership, this time to bolster networking, AI and cloud integrations. At the Red Hat Summit 2024, the two vendors will demonstrate how tightly integrating Cisco Application Centric Infrastructure (ACI) with Red Hat’s OpenShift can help customers improve their network operations.\n**Cisco-backed startup Corelight raises $150 million**\n_May 02, 2024_: Cisco is part of a group that backed security startup Corelight with $150 million in Series E funding. The new funding will enable Corelight to further develop its technology, which transforms network and cloud activity as well as packet capture into evidence that security teams use to proactively hunt for threats, accelerate response to incidents, gain network visibility, and create powerful analytics results, according to the startup.\n**Cisco marries AI and security with cloud-based data center offering**\n_April 18, 2024_: Cisco announces AI-based Hypershield, a self-upgrading security fabric that’s designed to protect distributed applications, devices and data.\n**Cisco: AI networking adds to data center sustainability challenges**\n_April 03, 2024_: Data centers are notorious energy hogs, and the increase in heavy-duty networking and compute power required to handle AI workloads is only going to exacerbate the sustainability issue. But there are efforts underway to address the growth of AI and ML in data centers while keeping energy efficiency, cooling and performance in mind.\n**Beware the gap between security readiness and confidence levels, Cisco warns**\n_March 27, 2024_: Security readiness among enterprises has dropped in the past year, while the confidence level of many organizations is up. This disparity between confidence levels and security readiness suggests that companies may be overestimating their ability to navigate the threat landscape, Cisco reports in its newly released Cybersecurity Readiness Index.\n**Cisco: AI tools, better workspaces would boost in-office appeal**\n_March 27, 2024_: Cisco released its hybrid work study and found 72% of employees are positive about returning to the office, but they want better-equipped workspaces and more modern collaboration technologies. Office spaces at many companies are too focused on individual work rather than structured around spaces that can encourage collaboration, social interaction and creative brainstorming, according to the survey, which polled 14,050 employees and 3,800 employers in 19 countries worldwide.\n**Cisco taps former Microsoft, Broadcom exec**\n_March 25, 2024_: Martin Lund will lead the group responsible for delivering the silicon, optics, and hardware for Cisco’s core switching, routing, and wireless offerings.\n**Cisco, Intel expand Wi-Fi 7 partnership**\n_March 21, 2024_: Joint development work by Cisco and Intel is aimed at delivering more reliable Wi-Fi connectivity and new capabilities for latency-sensitive applications.\n**Cisco aims AI advancements at data center infrastructure**\n_March 20, 2024_: The Splunk buy and Cisco’s partnership with Nvidia are part of its efforts to build data-center network infrastructure for supporting AI/ML workloads.\n**Cisco completes $28 billion Splunk acquisition**\n_March 18, 2024_: Cisco closed its $28 billion acquisition of Splunk, promising product innovations across its security, observability and AI portfolios with the integration of Splunk. Network security teams can use Splunk’s technology to gain better visibility into network traffic, firewalls, intrusion detection systems, and SIEM systems.\n**Cisco Talos: 3 post-compromise tactics that threaten your network infrastructure**\n_March 07, 2024_: The bad actors who are perpetrating advanced persistent threat (APT) attacks aren’t just looking to access your network. They want to hang around to collect valuable data or lay plans for future attacks. Post-compromise threats are growing, Cisco says, and they’re aimed largely at aging network infrastructure and edge devices that are long past end-of-life stage and may have critical unpatched vulnerabilities. “… the older legacy components have more avenues for access, especially if the devices are out of support and they haven’t been updated in three or four years,” said Nick Biasini, head of outreach at Cisco’s Talos security research arm.\n**Cisco, partners to offer tailored IoT/OT packages**\n_Feb. 29, 2024_: Cisco has implemented a new blueprint that involves working more closely with partners to offer packages of networking and software components that meld IT elements with Internet of Things (IoT) and operational technology (OT).\n**Cisco to cut 5% of workforce amid restructuring; layoffs will impact 4,200 jobs**\n_Feb. 14, 2024_: After days of speculation, Cisco announced a restructuring plan that will see the networking vendor cut 5%, or about 4,200 jobs, from its 84,900 workforce as it plans to continue to focus on high-strength areas such as AI and security.\n**Cisco brings AI assistant to cloud app security service**\n_Feb. 08, 2024_: Cisco is launching a generative AI-based assistant to help customers handle cloud-native application security issues more quickly and efficiently. The Cisco AI Assistant for Panoptica will help businesses streamline, prioritize, and remediate risks and misconfigurations in multi-cloud environments, according to Vijoy Pandey, senior vice president of Cisco’s Outshift advanced development group.\n**Cisco launches Motific hub to streamline generative AI deployment**\n_Feb. 07, 2024_: Cisco is delivering a cloud-based service that gives enterprise customers a centralized hub for managing AI elements. Called Motific, the service promises to help streamline and accelerate the creation, deployment and management of generative AI-based applications for the enterprise.\n**Cisco, Nvidia target secure AI with expanded partnership**\n_Feb. 06, 2024_: Cisco and Nvidia have expanded their partnership to offer integrated software and networking hardware that promises to help customers more easily spin up infrastructure to support AI applications. The agreement deepens both companies’ strategy to expand the role of Ethernet networking for AI workloads in the enterprise. It also gives both companies access to each other’s sales and support systems.\n**Cisco, Hitachi deliver managed hybrid cloud services**\n_Jan. 31, 2024_: Cisco and Hitachi Vantara have unveiled the first fruits of their partnership, signed last year, that aims to bring managed as-a-service offerings to enterprise customers with hybrid cloud environments. The joint offering, Hitachi EverFlex with Cisco Powered Hybrid Cloud, includes a range of converged infrastructure services that meld compute, networking and software technologies from Cisco and storage capabilities from Hitachi.\n**Cisco looks to ease management of software agents**\n_Jan. 26, 2024_: Cisco AppDynamics rolled out a new management product that aims to take the pressure off operations teams tasked with maintaining a growing raft of application and infrastructure agents. Smart Agent for Cisco AppDynamics can help customers spot and update out-of-date software agents as well as quickly on-board and manage new agents through a centralized user interface, Cisco stated.\n**Cisco brings SSE technology to new Kyndryl services**\n_Jan. 25, 2024_: Kyndryl’s new managed services incorporate Cisco’s Secure Access platform, which includes zero-trust network access, secure web gateway, and firewall as a service.\n**Cisco, T-Mobile team to offer managed 5G service**\n_Jan. 24, 2024_: Cisco and T-Mobile have teamed to offer a managed 5G-based connectivity service for remote branches and small offices. The T-Mobile-managed package, called Connected Workplace, will make use of Cisco Meraki 5G cellular gateways as well as its network and visibility management platform. The Meraki software includes cloud-managed security features and a central Meraki dashboard for network management support. Together with T-Mobile’s unlimited nationwide business internet service, the offering will allow organizations to network everything from end users and IoT devices to point-of-sale systems and video installations.\n**Cisco sees headway in quantum networking, but advances are slow**\nJan. 22, 2024: While core quantum networking technologies such as repeaters and photonics are being developed, it is security applications that are likely to be the first real-world developments that come out of the lab, according to Liz Centoni, executive vice president, chief strategy officer and general manager of applications at Cisco.\n**Cisco buy highlights container networking, security**\n_Jan. 17, 2024_: Cisco’s acquisition of startup Isovalent, developer of open-source tools Cilium and Tetragon, underscores the potential of the popular eBPF kernel technology for multicloud networking and security.\nSUBSCRIBE TO OUR NEWSLETTER\n### From our editors straight to your inbox\nGet started by entering your email address below.\nPlease enter a valid email address\nSubscribe\n## Show me more\nPopularArticlesPodcastsVideos\nnews\\\\\n\\\\\n**Intel sees supply shortage, will prioritize data center technology** \\\\\n\\\\\nBy Andy Patrizio\\\\\n\\\\\nOct 24, 20253 mins\\\\\n\\\\\nCPUs and ProcessorsData Center\\\\\n\\\\\nImage\nnews\\\\\n\\\\\n**Anthropic signs billion-dollar deal with Google Cloud** \\\\\n\\\\\nBy Mikael Markander\\\\\n\\\\\nOct 24, 20252 mins\\\\\n\\\\\nArtificial IntelligenceCloud ComputingGenerative AI\\\\\n\\\\\nImage\nnews analysis\\\\\n\\\\\n**How Patmos set up an AI data center in 90 days** \\\\\n\\\\\nBy Andy Patrizio\\\\\n\\\\\nOct 23, 20254 mins\\\\\n\\\\\nArtificial IntelligenceData Center DesignData Center Management\\\\\n\\\\\nImage\npodcast\\\\\n\\\\\n**Has the hype around ‘Internet of Things’ paid off? \\| Ep. 145** \\\\\n\\\\\nApr 18, 202436 mins\\\\\n\\\\\nIoT PlatformsIoT Security\\\\\n\\\\\nImage\npodcast\\\\\n\\\\\n**Episode 1: Understanding Cisco’s Converged SDN Transport** \\\\\n\\\\\nSep 24, 202120 mins\\\\\n\\\\\nCisco SystemsInternetNetworking\\\\\n\\\\\nImage\npodcast\\\\\n\\\\\n**Episode 2: Pluggable Optics and the Internet for the Future** \\\\\n\\\\\nSep 23, 202117 mins\\\\\n\\\\\nCisco SystemsComputers and PeripheralsInternet\\\\\n\\\\\nImage\nvideo\\\\\n\\\\\n**Master Linux Math with the bc Command \\| Easy CLI Calculations Explained!** \\\\\n\\\\\nJun 23, 20251 mins\\\\\n\\\\\nOperating Systems\\\\\n\\\\\nImage\nvideo\\\\\n\\\\\n**Master Linux Math in Seconds: How to Use the expr Command Like a Pro** \\\\\n\\\\\nJun 17, 20251 mins\\\\\n\\\\\nOperating Systems\\\\\n\\\\\nImage\nvideo\\\\\n\\\\\n**How to Do Math in the Command Line Using Double Parentheses** \\\\\n\\\\\nJun 6, 20251 mins\\\\\n\\\\\nOperating Systems\\\\\n\\\\\nImage",
      "original_markdown_length": 41961,
      "processed_markdown_length": 41728,
      "compression_ratio": 0.9944472248039846
    },
    {
      "url": "https://cisa.gov/news-events/directives/ed-25-03-identify-and-mitigate-potential-compromise-cisco-devices",
      "title": "ED 25-03: Identify and Mitigate Potential Compromise of Cisco Devices | CISA",
      "markdown": "Skip to main content\n\nDot gov\n\n**Official websites use .gov**\n\nA **.gov** website belongs to an official government organization in the United States.\n\nHTTPS\n\n**Secure .gov websites use HTTPS**\n\nA **lock** (LockA locked padlock) or ** means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n\n**NOTICE** **: Due to the lapse in federal funding, this website will not be actively managed.**\n\n* * *\n\nFree Cyber Services Cybersecurity Awareness Month Secure by design Shields Up Report A Cyber Issue\n\nShare:\n\nShare to FacebookShare to XShare to LinkedinShare to Email\n\nEmergency Directives\n\n# ED 25-03: Identify and Mitigate Potential Compromise of Cisco Devices\n\nSeptember 25, 2025\n\nRelated topics:\n\nCybersecurity Best Practices\n\nEmergency Directive 25-03: Identify and Mitigate Potential Compromise of Cisco Devices\n\nThis page contains a web-friendly version of the Cybersecurity and Infrastructure Security Agency’s Emergency Directive 25-03: Identify and Mitigate Potential Compromise of Cisco Devices.\n\n_Section 3553(h) of title 44, U.S. Code, authorizes the Secretary of Homeland Security, in response to a known or reasonably suspected information security threat, vulnerability, or incident that represents a substantial threat to the information security of an agency, to “issue an emergency directive to the head of an agency to take any lawful action with respect to the operation of the information system, including such systems used or operated by another entity on behalf of an agency, that collects, processes, stores, transmits, disseminates, or otherwise maintains agency information, for the purpose of protecting the information system from, or mitigating, an information security threat.” 44 U.S.C. § 3553(h)(1)–(2). Section 2205(3) of the Homeland Security Act of 2002, as amended, delegates this authority to the Director of the Cybersecurity and Infrastructure Security Agency. 6 U.S.C. § 655(3). Federal agencies are required to comply with these directives. 44 U.S.C. § 3554 (a)(1)(B)(v). These directives do not apply to statutorily defined “national security systems” nor to systems operated by the Department of War or the Intelligence Community. 44 U.S.C. § 3553(d), (e)(2), (e)(3), (h)(1)(B)._\n\n## **Background**\n\nCISA is aware of an ongoing exploitation campaign by an advanced threat actor targeting Cisco Adaptive Security Appliances (ASA). The campaign is widespread and involves exploiting zero-day vulnerabilities to gain unauthenticated remote code execution on ASAs, as well as manipulating read-only memory (ROM) to persist through reboot and system upgrade. This activity presents a significant risk to victim networks. Cisco assesses that this campaign is connected to the ArcaneDoor activity identified in early 2024 and that this threat actor has demonstrated a capability to successfully modify ASA ROM at least as early as 2024. These zero-day vulnerabilities in the Cisco ASA platform are also present in specific versions of Cisco Firepower. Firepower appliances' Secure Boot would detect the identified manipulation of the ROM.\n\nCISA has assessed that the following CVEs pose an unacceptable risk to federal information systems:\n\n- CVE-2025-20333(link is external)\") – allows for remote code execution\n- CVE-2025-20362(link is external)\") – allows for privilege escalation\n\nCISA mandates that these vulnerabilities be addressed immediately through the actions outlined in this Directive.\n\nCISA is directing agencies to account for all Cisco ASA and Firepower devices, collect forensics and assess compromise via CISA-provided procedures and tools, disconnect end-of-support devices, and upgrade devices that will remain in service. These actions are directed to address the immediate risk, assess compromise, and inform analysis of the ongoing threat actor campaign.\n\n## **Required Actions**\n\nThis Emergency Directive requires agencies to take the following actions:\n\n1. Immediately identify all Cisco ASA platforms (ASA hardware, ASA-Service Module \\[ASA-SM\\], ASA Virtual \\[ASAv\\], and ASA firmware on Firepower 2100/4100/9300) and all Cisco Firepower Threat Defense (FTD) appliances.\n\n**For all public-facing Cisco ASA hardware appliances:**\n\n2. Follow CISA’s step-by-step Core Dump and Hunt Instructions Parts 1-3 and submit core dump(s) via the Malware Next Gen portal by 11:59PM EDT on September 26, 2025.\n\n1. If the result is “Compromise Detected,” agencies must immediately disconnect the device from their network **(but do not power off**), report the incident to CISA, and work with CISA on incident response and eviction actions.\n2. If the result is “No Compromise Detected” agencies may proceed to requirement 3 and 4.\n\n**If the result is “No Compromise Detected”:**\n\n3. **For ASA hardware models with an end of support date on or before September 30, 2025, take the following action:**\n1. Permanently disconnect these devices on or before September 30, 2025, as these legacy platforms/releases cannot meet current vendor support and update requirements.\n2. Agencies that cannot meet this requirement must apply the latest Cisco-provided updates for software by 11:59PM EDT on September 26, 2025, report to CISA mission critical needs preventing such action and plans for eventual decommissioning of the device as directed by requirement 6.\n4. **For ASA hardware models with an end of support date of August 31, 2026:** Download and apply the latest Cisco-provided updates for software by 11:59PM EDT on September 26, 2025, and apply all subsequent updates via Cisco’s download portal within 48 hours of release.\n\n**For all ASAv and Firepower FTD:**\n\n5. Download and apply the latest Cisco-provided updates for software by 11:59PM EDT on September 26, 2025, and apply all subsequent updates via Cisco’s download portal within 48 hours of release.\n\n**All agencies, regardless of the results of requirement 2, must:**\n\n6. By **11:59 PM EDT on October 2, 2025**, report to CISA (using the provided template) a complete inventory of all instances of products within scope on agency networks, including details on actions taken and results.\n\n_These required actions apply to agency assets in any federal information system, including an information system used or operated by another entity on behalf of an agency, that collects, processes, stores, transmits, disseminates, or otherwise maintains agency information._\n\n_For federal information systems hosted in third-party environments, each agency is responsible for maintaining an inventory of its information systems hosted in those environments (FedRAMP Authorized or otherwise) and obtaining status updates pertaining to, and to ensure compliance with, this Directive. Agencies should work through the FedRAMP program office to obtain these updates for FedRAMP-authorized cloud service providers and work directly with service providers that are not FedRAMP-authorized._\n\n_All other provisions specified in this Directive remain applicable._\n\n_Note: entities outside of the Federal Executive Branch that wish to perform the actions outlined in this section may follow the same CISA instructions to collect and upload a core dump file to CISA for analysis._\n\n## **CISA Actions:**\n\n1. CISA will provide agencies with a template that will be used for reporting agency actions following the issuance of this Directive.\n2. CISA will continue efforts to identify instances and potential compromises associated with this threat activity, provide partner notifications, and will issue additional guidance and direction, as appropriate.\n3. CISA can provide technical assistance to agencies who are without internal capabilities sufficient to comply with this Directive.\n4. By February 1, 2026, CISA will provide a report to the Secretary of Homeland Security, the National Cyber Director, the Director of the Office of Management and Budget, and the Federal Chief Information Security Officer identifying cross-agency status and outstanding issues.\n\n## **Additional Information**\n\nVisit  or contact the following for:\n\n- General information, assistance, and reporting – CyberDirectives@cisa.dhs.gov(link sends email)\n- Reporting indications of compromise – contact@cisa.dhs.gov(link sends email)\n\nFor further instructions on how to perform a “core dump” please visit \n\nFor eviction guidance please visit \n\n### Tags\n\n**Topics**:\nCybersecurity Best Practices\n\n## Related Directives\n\nOct 15, 2025\n\n### ED 26-01: Mitigate Vulnerabilities in F5 Devices\n\nSep 25, 2025\n\n### Supplemental Direction ED 25-03: Core Dump and Hunt Instructions\n\nAug 07, 2025\n\n### ED 25-02: Mitigate Microsoft Exchange Vulnerability\n\nApr 02, 2024\n\n### ED 24-02: Mitigating the Significant Risk from Nation-State Compromise of Microsoft Corporate Email System\n\n| | |\n| --- | --- |\n| | |\n\n| | |\n| --- | --- |\n| | |",
      "html": "",
      "metadata": {
        "title": "ED 25-03: Identify and Mitigate Potential Compromise of Cisco Devices | CISA",
        "description": "This page contains a web-friendly version of the Cybersecurity and Infrastructure Security Agency’s Emergency Directive 25-03: Identify and Mitigate Potential",
        "language": "en",
        "sourceURL": "https://cisa.gov/news-events/directives/ed-25-03-identify-and-mitigate-potential-compromise-cisco-devices"
      },
      "content_type": "news",
      "success": true,
      "error": null,
      "scraped_at": "2025-10-24T10:47:42.921028",
      "processed_markdown": "Skip to main content\nDot gov\n**Official websites use .gov**\nA **.gov** website belongs to an official government organization in the United States.\nHTTPS\n**Secure .gov websites use HTTPS**\nA **lock** (LockA locked padlock) or ** means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n**NOTICE** **: Due to the lapse in federal funding, this website will not be actively managed.**\n* * *\nFree Cyber Services Cybersecurity Awareness Month Secure by design Shields Up Report A Cyber Issue\nShare:\nShare to FacebookShare to XShare to LinkedinShare to Email\nEmergency Directives\n# ED 25-03: Identify and Mitigate Potential Compromise of Cisco Devices\nSeptember 25, 2025\nRelated topics:\nCybersecurity Best Practices\nEmergency Directive 25-03: Identify and Mitigate Potential Compromise of Cisco Devices\nThis page contains a web-friendly version of the Cybersecurity and Infrastructure Security Agency’s Emergency Directive 25-03: Identify and Mitigate Potential Compromise of Cisco Devices.\n_Section 3553(h) of title 44, U.S. Code, authorizes the Secretary of Homeland Security, in response to a known or reasonably suspected information security threat, vulnerability, or incident that represents a substantial threat to the information security of an agency, to “issue an emergency directive to the head of an agency to take any lawful action with respect to the operation of the information system, including such systems used or operated by another entity on behalf of an agency, that collects, processes, stores, transmits, disseminates, or otherwise maintains agency information, for the purpose of protecting the information system from, or mitigating, an information security threat.” 44 U.S.C. § 3553(h)(1)–(2). Section 2205(3) of the Homeland Security Act of 2002, as amended, delegates this authority to the Director of the Cybersecurity and Infrastructure Security Agency. 6 U.S.C. § 655(3). Federal agencies are required to comply with these directives. 44 U.S.C. § 3554 (a)(1)(B)(v). These directives do not apply to statutorily defined “national security systems” nor to systems operated by the Department of War or the Intelligence Community. 44 U.S.C. § 3553(d), (e)(2), (e)(3), (h)(1)(B)._\n## **Background**\nCISA is aware of an ongoing exploitation campaign by an advanced threat actor targeting Cisco Adaptive Security Appliances (ASA). The campaign is widespread and involves exploiting zero-day vulnerabilities to gain unauthenticated remote code execution on ASAs, as well as manipulating read-only memory (ROM) to persist through reboot and system upgrade. This activity presents a significant risk to victim networks. Cisco assesses that this campaign is connected to the ArcaneDoor activity identified in early 2024 and that this threat actor has demonstrated a capability to successfully modify ASA ROM at least as early as 2024. These zero-day vulnerabilities in the Cisco ASA platform are also present in specific versions of Cisco Firepower. Firepower appliances' Secure Boot would detect the identified manipulation of the ROM.\nCISA has assessed that the following CVEs pose an unacceptable risk to federal information systems:\n- CVE-2025-20333(link is external)\") – allows for remote code execution\n- CVE-2025-20362(link is external)\") – allows for privilege escalation\nCISA mandates that these vulnerabilities be addressed immediately through the actions outlined in this Directive.\nCISA is directing agencies to account for all Cisco ASA and Firepower devices, collect forensics and assess compromise via CISA-provided procedures and tools, disconnect end-of-support devices, and upgrade devices that will remain in service. These actions are directed to address the immediate risk, assess compromise, and inform analysis of the ongoing threat actor campaign.\n## **Required Actions**\nThis Emergency Directive requires agencies to take the following actions:\n1. Immediately identify all Cisco ASA platforms (ASA hardware, ASA-Service Module \\[ASA-SM\\], ASA Virtual \\[ASAv\\], and ASA firmware on Firepower 2100/4100/9300) and all Cisco Firepower Threat Defense (FTD) appliances.\n**For all public-facing Cisco ASA hardware appliances:**\n2. Follow CISA’s step-by-step Core Dump and Hunt Instructions Parts 1-3 and submit core dump(s) via the Malware Next Gen portal by 11:59PM EDT on September 26, 2025.\n1. If the result is “Compromise Detected,” agencies must immediately disconnect the device from their network **(but do not power off**), report the incident to CISA, and work with CISA on incident response and eviction actions.\n2. If the result is “No Compromise Detected” agencies may proceed to requirement 3 and 4.\n**If the result is “No Compromise Detected”:**\n3. **For ASA hardware models with an end of support date on or before September 30, 2025, take the following action:**\n1. Permanently disconnect these devices on or before September 30, 2025, as these legacy platforms/releases cannot meet current vendor support and update requirements.\n2. Agencies that cannot meet this requirement must apply the latest Cisco-provided updates for software by 11:59PM EDT on September 26, 2025, report to CISA mission critical needs preventing such action and plans for eventual decommissioning of the device as directed by requirement 6.\n4. **For ASA hardware models with an end of support date of August 31, 2026:** Download and apply the latest Cisco-provided updates for software by 11:59PM EDT on September 26, 2025, and apply all subsequent updates via Cisco’s download portal within 48 hours of release.\n**For all ASAv and Firepower FTD:**\n5. Download and apply the latest Cisco-provided updates for software by 11:59PM EDT on September 26, 2025, and apply all subsequent updates via Cisco’s download portal within 48 hours of release.\n**All agencies, regardless of the results of requirement 2, must:**\n6. By **11:59 PM EDT on October 2, 2025**, report to CISA (using the provided template) a complete inventory of all instances of products within scope on agency networks, including details on actions taken and results.\n_These required actions apply to agency assets in any federal information system, including an information system used or operated by another entity on behalf of an agency, that collects, processes, stores, transmits, disseminates, or otherwise maintains agency information._\n_For federal information systems hosted in third-party environments, each agency is responsible for maintaining an inventory of its information systems hosted in those environments (FedRAMP Authorized or otherwise) and obtaining status updates pertaining to, and to ensure compliance with, this Directive. Agencies should work through the FedRAMP program office to obtain these updates for FedRAMP-authorized cloud service providers and work directly with service providers that are not FedRAMP-authorized._\n_All other provisions specified in this Directive remain applicable._\n_Note: entities outside of the Federal Executive Branch that wish to perform the actions outlined in this section may follow the same CISA instructions to collect and upload a core dump file to CISA for analysis._\n## **CISA Actions:**\n1. CISA will provide agencies with a template that will be used for reporting agency actions following the issuance of this Directive.\n2. CISA will continue efforts to identify instances and potential compromises associated with this threat activity, provide partner notifications, and will issue additional guidance and direction, as appropriate.\n3. CISA can provide technical assistance to agencies who are without internal capabilities sufficient to comply with this Directive.\n4. By February 1, 2026, CISA will provide a report to the Secretary of Homeland Security, the National Cyber Director, the Director of the Office of Management and Budget, and the Federal Chief Information Security Officer identifying cross-agency status and outstanding issues.\n## **Additional Information**\nVisit  or contact the following for:\n- General information, assistance, and reporting – CyberDirectives@cisa.dhs.gov(link sends email)\n- Reporting indications of compromise – contact@cisa.dhs.gov(link sends email)\nFor further instructions on how to perform a “core dump” please visit\nFor eviction guidance please visit\n### Tags\n**Topics**:\nCybersecurity Best Practices\n## Related Directives\nOct 15, 2025\n### ED 26-01: Mitigate Vulnerabilities in F5 Devices\nSep 25, 2025\n### Supplemental Direction ED 25-03: Core Dump and Hunt Instructions\nAug 07, 2025\n### ED 25-02: Mitigate Microsoft Exchange Vulnerability\nApr 02, 2024\n### ED 24-02: Mitigating the Significant Risk from Nation-State Compromise of Microsoft Corporate Email System\n| | |\n| --- | --- |\n| | |\n| | |\n| --- | --- |\n| | |",
      "original_markdown_length": 8840,
      "processed_markdown_length": 8777,
      "compression_ratio": 0.9928733031674208
    },
    {
      "url": "https://finance.yahoo.com/quote/CSCO/press-releases",
      "title": "Cisco Systems, Inc. (CSCO) Latest Press Releases & Corporate News - Yahoo Finance",
      "markdown": "Oops, something went wrong\n\nSkip to navigation Skip to main content Skip to right column\n\nCSCO: Risk or rebound?\n\nCisco Systems recently experienced a **28.8% price jump**, prompting discussions about its valuation. The company is also actively engaging in community initiatives and enhancing its cybersecurity offerings.\n\nAll News Earnings Calls Press Releases SEC Filings\n\n- Pinnacle Financial Partners Lands in Top 5 Best Workplaces for Women\n\n**Pinnacle Financial Partners Lands in Top 5 Best Workplaces for Women**\n\n- City of Los Angeles, LA Nonprofits Partner with Cisco to Launch New Community Wi-Fi\n\n**City of Los Angeles, LA Nonprofits Partner with Cisco to Launch New Community Wi-Fi**\n\n- Igniting Our Future Workforce: Shaping the Future in Europe Through Cisco Networking Academy\n\n**Igniting Our Future Workforce: Shaping the Future in Europe Through Cisco Networking Academy**\n\n- Cisco unveils immersive AI security operations centre showcase to help prepare organizations from future threats\n\n**Cisco unveils immersive AI security operations centre showcase to help prepare organizations from future threats**\n\n- The OpenSSL Corporation and the OpenSSL Foundation Celebrate the Success of the Inaugural OpenSSL Conference in Prague\n\n**The OpenSSL Corporation and the OpenSSL Foundation Celebrate the Success of the Inaugural OpenSSL Conference in Prague**\n\n- /C O R R E C T I O N -- Terzo/\n\n**/C O R R E C T I O N -- Terzo/**\n\n- LINEN Cloud Secures CIO-Led Strategic Investment to Accelerate Intelligent Planning in the Cloud\n\n**LINEN Cloud Secures CIO-Led Strategic Investment to Accelerate Intelligent Planning in the Cloud**\n\n- Hyperscale Data Center Market Outlook 2025-2030 | Sustainable Data Hubs - Microgrids and Liquid Cooling Lead the Way\n\n**Hyperscale Data Center Market Outlook 2025-2030 \\| Sustainable Data Hubs - Microgrids and Liquid Cooling Lead the Way**\n\n- IGEL and Asc3nd Collaborate with Cisco, the National Defense University1 to Accelerate DoW Comply-to-Connect and Zero Trust Mission Readiness\n\n**IGEL and Asc3nd Collaborate with Cisco, the National Defense University1 to Accelerate DoW Comply-to-Connect and Zero Trust Mission Readiness**\n\n- JANA PARTNERS, TRAVIS KELCE, AND LEADING EXECUTIVES INVEST IN SIX FLAGS ENTERTAINMENT\n\n**JANA PARTNERS, TRAVIS KELCE, AND LEADING EXECUTIVES INVEST IN SIX FLAGS ENTERTAINMENT**\n\n- AV-Comparatives Releases Latest Security Test Results for Enterprise and Consumer Markets\n\n**AV-Comparatives Releases Latest Security Test Results for Enterprise and Consumer Markets**\n\n- Comcast Business Expands Partnership with Cisco to Bring Secure Networking Solutions to Millions of Emerging Enterprises\n\n**Comcast Business Expands Partnership with Cisco to Bring Secure Networking Solutions to Millions of Emerging Enterprises**\n\n- AI Server Research and Competitive Analysis Report 2025: A $1.84 Trillion Market by 2033 Featuring Dell, Cisco, IBM, HP, Huawei, NVIDIA, Fujitsu, ADLINK Technology, Lenovo, and Super Micro Computer,\n\n**AI Server Research and Competitive Analysis Report 2025: A $1.84 Trillion Market by 2033 Featuring Dell, Cisco, IBM, HP, Huawei, NVIDIA, Fujitsu, ADLINK Technology, Lenovo, and Super Micro Computer,**\n\n- Splunk Report Shows Observability is a Business Catalyst for AI Adoption, Customer Experience, and Product Innovation\n\n**Splunk Report Shows Observability is a Business Catalyst for AI Adoption, Customer Experience, and Product Innovation**\n\n- Boston Beer Company Names Phil Hodges Chief Operating Officer\n\n**Boston Beer Company Names Phil Hodges Chief Operating Officer**\n\n- Unified Communications (UC) Market Research and Forecasts, 2025-2034 Featuring Avaya, Cisco Systems, Microsoft, IBM, RingCentral, and 8x8 Market Research and Forecasts, 2025-2034 Featuring Avaya, Cisco Systems, Microsoft, IBM, RingCentral, and 8x8\")\n\n**Unified Communications (UC) Market Research and Forecasts, 2025-2034 Featuring Avaya, Cisco Systems, Microsoft, IBM, RingCentral, and 8x8** Market Research and Forecasts, 2025-2034 Featuring Avaya, Cisco Systems, Microsoft, IBM, RingCentral, and 8x8\")\n\n- Pindrop Brings Advanced AI Fraud Detection Across Communication Channels with Webex by Cisco\n\n**Pindrop Brings Advanced AI Fraud Detection Across Communication Channels with Webex by Cisco**\n\n- Cisco AI research: AI-ready Companies Outpace Peers in the Race to Value\n\n**Cisco AI research: AI-ready Companies Outpace Peers in the Race to Value**\n\n- Indoor Location Market Surges to $31.4 billion by 2029 - Dominated by Cisco (US), Google (US), Microsoft (US), Google (US), Microsoft (US)\")\n\n**Indoor Location Market Surges to $31.4 billion by 2029 - Dominated by Cisco (US), Google (US), Microsoft (US)**, Google (US), Microsoft (US)\")\n\n- UAE Cyber Security Industry Report 2025: Market Strengthened by Collaboration Between Local Leaders Like DarkMatter, Help AG, and CPX and Global Vendors Including IBM, Cisco, and Palo Alto Networks\n\n**UAE Cyber Security Industry Report 2025: Market Strengthened by Collaboration Between Local Leaders Like DarkMatter, Help AG, and CPX and Global Vendors Including IBM, Cisco, and Palo Alto Networks**",
      "html": "",
      "metadata": {
        "title": "Cisco Systems, Inc. (CSCO) Latest Press Releases & Corporate News - Yahoo Finance",
        "description": "Get the latest Cisco Systems, Inc. (CSCO) stock news and headlines to help you in your trading and investing decisions.",
        "language": "en-US",
        "sourceURL": "https://finance.yahoo.com/quote/CSCO/press-releases"
      },
      "content_type": "news",
      "success": true,
      "error": null,
      "scraped_at": "2025-10-24T10:47:42.921515",
      "processed_markdown": "Oops, something went wrong\nSkip to navigation Skip to main content Skip to right column\nCSCO: Risk or rebound?\nCisco Systems recently experienced a **28.8% price jump**, prompting discussions about its valuation. The company is also actively engaging in community initiatives and enhancing its cybersecurity offerings.\nAll News Earnings Calls Press Releases SEC Filings\n- Pinnacle Financial Partners Lands in Top 5 Best Workplaces for Women\n**Pinnacle Financial Partners Lands in Top 5 Best Workplaces for Women**\n- City of Los Angeles, LA Nonprofits Partner with Cisco to Launch New Community Wi-Fi\n**City of Los Angeles, LA Nonprofits Partner with Cisco to Launch New Community Wi-Fi**\n- Igniting Our Future Workforce: Shaping the Future in Europe Through Cisco Networking Academy\n**Igniting Our Future Workforce: Shaping the Future in Europe Through Cisco Networking Academy**\n- Cisco unveils immersive AI security operations centre showcase to help prepare organizations from future threats\n**Cisco unveils immersive AI security operations centre showcase to help prepare organizations from future threats**\n- The OpenSSL Corporation and the OpenSSL Foundation Celebrate the Success of the Inaugural OpenSSL Conference in Prague\n**The OpenSSL Corporation and the OpenSSL Foundation Celebrate the Success of the Inaugural OpenSSL Conference in Prague**\n- /C O R R E C T I O N -- Terzo/\n**/C O R R E C T I O N -- Terzo/**\n- LINEN Cloud Secures CIO-Led Strategic Investment to Accelerate Intelligent Planning in the Cloud\n**LINEN Cloud Secures CIO-Led Strategic Investment to Accelerate Intelligent Planning in the Cloud**\n- Hyperscale Data Center Market Outlook 2025-2030 | Sustainable Data Hubs - Microgrids and Liquid Cooling Lead the Way\n**Hyperscale Data Center Market Outlook 2025-2030 \\| Sustainable Data Hubs - Microgrids and Liquid Cooling Lead the Way**\n- IGEL and Asc3nd Collaborate with Cisco, the National Defense University1 to Accelerate DoW Comply-to-Connect and Zero Trust Mission Readiness\n**IGEL and Asc3nd Collaborate with Cisco, the National Defense University1 to Accelerate DoW Comply-to-Connect and Zero Trust Mission Readiness**\n- JANA PARTNERS, TRAVIS KELCE, AND LEADING EXECUTIVES INVEST IN SIX FLAGS ENTERTAINMENT\n**JANA PARTNERS, TRAVIS KELCE, AND LEADING EXECUTIVES INVEST IN SIX FLAGS ENTERTAINMENT**\n- AV-Comparatives Releases Latest Security Test Results for Enterprise and Consumer Markets\n**AV-Comparatives Releases Latest Security Test Results for Enterprise and Consumer Markets**\n- Comcast Business Expands Partnership with Cisco to Bring Secure Networking Solutions to Millions of Emerging Enterprises\n**Comcast Business Expands Partnership with Cisco to Bring Secure Networking Solutions to Millions of Emerging Enterprises**\n- AI Server Research and Competitive Analysis Report 2025: A $1.84 Trillion Market by 2033 Featuring Dell, Cisco, IBM, HP, Huawei, NVIDIA, Fujitsu, ADLINK Technology, Lenovo, and Super Micro Computer,\n**AI Server Research and Competitive Analysis Report 2025: A $1.84 Trillion Market by 2033 Featuring Dell, Cisco, IBM, HP, Huawei, NVIDIA, Fujitsu, ADLINK Technology, Lenovo, and Super Micro Computer,**\n- Splunk Report Shows Observability is a Business Catalyst for AI Adoption, Customer Experience, and Product Innovation\n**Splunk Report Shows Observability is a Business Catalyst for AI Adoption, Customer Experience, and Product Innovation**\n- Boston Beer Company Names Phil Hodges Chief Operating Officer\n**Boston Beer Company Names Phil Hodges Chief Operating Officer**\n- Unified Communications (UC) Market Research and Forecasts, 2025-2034 Featuring Avaya, Cisco Systems, Microsoft, IBM, RingCentral, and 8x8 Market Research and Forecasts, 2025-2034 Featuring Avaya, Cisco Systems, Microsoft, IBM, RingCentral, and 8x8\")\n**Unified Communications (UC) Market Research and Forecasts, 2025-2034 Featuring Avaya, Cisco Systems, Microsoft, IBM, RingCentral, and 8x8** Market Research and Forecasts, 2025-2034 Featuring Avaya, Cisco Systems, Microsoft, IBM, RingCentral, and 8x8\")\n- Pindrop Brings Advanced AI Fraud Detection Across Communication Channels with Webex by Cisco\n**Pindrop Brings Advanced AI Fraud Detection Across Communication Channels with Webex by Cisco**\n- Cisco AI research: AI-ready Companies Outpace Peers in the Race to Value\n**Cisco AI research: AI-ready Companies Outpace Peers in the Race to Value**\n- Indoor Location Market Surges to $31.4 billion by 2029 - Dominated by Cisco (US), Google (US), Microsoft (US), Google (US), Microsoft (US)\")\n**Indoor Location Market Surges to $31.4 billion by 2029 - Dominated by Cisco (US), Google (US), Microsoft (US)**, Google (US), Microsoft (US)\")\n- UAE Cyber Security Industry Report 2025: Market Strengthened by Collaboration Between Local Leaders Like DarkMatter, Help AG, and CPX and Global Vendors Including IBM, Cisco, and Palo Alto Networks\n**UAE Cyber Security Industry Report 2025: Market Strengthened by Collaboration Between Local Leaders Like DarkMatter, Help AG, and CPX and Global Vendors Including IBM, Cisco, and Palo Alto Networks**",
      "original_markdown_length": 5126,
      "processed_markdown_length": 5082,
      "compression_ratio": 0.9914163090128756
    },
    {
      "url": "https://telecom.economictimes.indiatimes.com/tag/cisco",
      "title": "Cisco  - Latest cisco , Information & Updates - Telecom  -ET Telecom",
      "markdown": "# CISCO\n\n- iron mountain looks to offer infra in india for ai needs of global firms arvind subramanian\n\n## Iron Mountain looks to offer infra in India for AI needs of global firms: Arvind Subramanian\n\n### The two mega upcoming campuses in Mumbai and Chennai, with a capacity of 80MW and 50MW, respectively, will cater to AI-led use cases, he added.\n\n- **HPE's $14 billion Juniper acquisition could face state challenge**\\\\\nhpe s 14 billion juniper acquisition could face state challenge\n- **Only 17% of Indian organisations fully ready to capture AI value: Cisco report**\\\\\nonly 17 of indian organisations fully ready to capture ai value cisco report\n- **Make in India: HFCL wins deal to deploy IP/MPLS routers for Vodafone Idea’s 5G network**\\\\\nmake in india hfcl wins deal to deploy ip mpls routers for vodafone idea s 5g network\n- **Cisco to set-up data centers in Mumbai, Chennai to launch Webex Calling, contact center services**\\\\\ncisco to set up data centers in mumbai chennai to launch webex calling contact center services\n- **HFCL bags contracts for 40-45% of GPs under BharatNet Phase 3, commences gear supply: Executive**\\\\\nhfcl bags contracts for 40 45 of gps under bharatnet phase 3 commences gear supply executive\n- **US sounds alarm over hackers targeting Cisco security devices**\\\\\nus sounds alarm over hackers targeting cisco security devices\n- **Cisco rolls out software aimed at connecting a quantum computing cloud**\\\\\ncisco rolls out software aimed at connecting a quantum computing cloud\n- **DoT extends deadline for mandatory testing of broadband gears until December 31**\\\\\ndot extends deadline for mandatory testing of broadband gears until december 31\n\n## Join the community of 2M+ industry professionals\n\nNewsletter icon\n\n### Subscribe to our Daily Newsletter\n\nEnter Email\n\nBy continuing you agree to our\nPrivacy Policy &\nTerms & Conditions\n\nDownload ETTelecom App for Realtime updates\n\nSeamless reading experience. Save your favourite.\n\nScan to download App\n\n[]( \"\")[]( \"\")\n\n## Download ETTelecom App for Realtime updates of content you follow\n\n- Seamless reading experience\n- Save your favourite articles\n\n[]( \"\")[]( \"App Store\")\n\nAdvertisement\n\n## More in CISCO\n\n- ### India's IT sector nervous as US proposes outsourcing tax\n\nIndia's $283 billion information technology sector has thrived for more than three decades exporting software services, with prominent clients including Apple, American Express, Cisco, Citigroup, FedEx and Home Depot. It has grown to make up over 7% of GDP.\n\nindia s it sector nervous as us proposes outsourcing tax\n- ### How US tech companies enabled China's digital police state\n\n​​Though the companies often claim they aren't responsible for how their products are used, some directly pitched their tech as tools for Chinese police to control citizens, marketing materials from IBM, Dell, Cisco, and Seagate show.\n\nhow us tech companies enabled china s digital police state\n- ### Tata Communications, Cisco partner to accelerate IoT deployments\n\nTata Communications will combine its “MOVE” eSIM orchestration solution with Cisco’s “IoT Control Center” to enable simplified and scalable IoT deployments globally.\n\ntata communications cisco partner to accelerate iot deployments\n- ### Check Point says India a fast-growing mkt, traction increasing for AI, Nvidia-powered solutions\n\nCheck Point estimates that Indian enterprises face an average of 3,247 cyberattacks per week, nearly double the global average of 1,981 over the last six months, a figure which it believes can be reduced via AI-enabled cyber solutions.\n\ncheck point says india a fast growing mkt traction increasing for ai nvidia powered solutions\n- ### Cisco does not aim to use AI to cut jobs, says Chuck Robbins: Report\n\nHe added that Cisco has adopted a balanced approach, utilising human expertise and agentic AI wherever applicable. ​The technology is capable of handling and executing complex tasks precisely with minimal-to-no human intervention, a trend that has sparked fears of mass layoffs in the telecoms and technology sectors.\n\ncisco does not aim to use ai to cut jobs says chuck robbins report\n- ### Cisco projects upbeat quarterly revenue as AI fuels networking equipment demand\n\nCisco's AI infrastructure orders exceeded $800 million in the fourth quarter, bringing the total for fiscal 2025 to over $2 billion, more than double its original target, CEO Chuck Robbins said on a post-earnings call.\n\ncisco projects upbeat quarterly revenue as ai fuels networking equipment demand\n- ### Ericsson, Nokia, Qualcomm, Cisco ink pacts with BSNL to train students in 5G, IoT, AI/ML\n\nTarun Chhabra, country head, Nokia India; Harish Krishnan, managing director & chief policy officer, Cisco; Nitin Bansal, MD, India head network solutions, South East Asia, Oceania & India, Ericsson India; Savi Soin, president, Qualcomm India; and Robert Ravi, CMD, BSNL, signed the MoUs.\n\nericsson nokia qualcomm cisco ink pacts with bsnl to train students in 5g iot ai ml\n- ### Cisco suffers data breach: How hackers used ‘voice attack’ to steal user information\n\nThe networking giant stated that the hackers accessed and exported a subset of user data, though the company did not specify the number of people affected.\n\ncisco suffers data breach how hackers used voice attack to steal user information\n- ### American Cisco to bolster Ambani's Jio hyperscale ambition, enable large data centres\n\n'They are setting up AI infrastructure, Jio Brain and they basically want to be the hyper scaler in India where they want to create large data centers, where they will host AI training, inferencing and cloud-based AI applications. We'll provide data centers, and the connectivity for them.'\n\n- Exclusive\n\namerican cisco to bolster ambani s jio hyperscale ambition enable large data centres\n- ### Starlink, Cisco team up for satellite-ready Wi-Fi routers\n\nChuck Robbins-headed Cisco's satellite-enabled routers provide two-way satellite communication and offer support for multicast and unicast traffic.\n\nstarlink cisco team up for satellite ready wi fi routers\n- ### Deploying made in India gear in BharatNet 3 program: Cisco's Daisy Chittilapilly\n\nSeveral bidders have won bids by quoting Cisco's network products, conforming to requirements.\n\ndeploying made in india gear in bharatnet 3 program cisco s daisy chittilapilly\n\nLoad More\n\nAdvertisement\n\nGet updates on your preferred social platform\n\nFollow us for the latest news, insider access to events and more.\n\nLinkedinTwitterYoutubeFacebookInstagram",
      "html": "",
      "metadata": {
        "title": "Cisco  - Latest cisco , Information & Updates - Telecom  -ET Telecom",
        "description": "ETTelecom.com brings latest cisco news, views and updates from all top sources for the Indian Telecom industry., ETTelecom.com brings latest cisco news, views and updates from all top sources for the Indian Telecom industry.",
        "language": "en",
        "sourceURL": "https://telecom.economictimes.indiatimes.com/tag/cisco"
      },
      "content_type": "news",
      "success": true,
      "error": null,
      "scraped_at": "2025-10-24T10:47:42.922177",
      "processed_markdown": "# CISCO\n- iron mountain looks to offer infra in india for ai needs of global firms arvind subramanian\n## Iron Mountain looks to offer infra in India for AI needs of global firms: Arvind Subramanian\n### The two mega upcoming campuses in Mumbai and Chennai, with a capacity of 80MW and 50MW, respectively, will cater to AI-led use cases, he added.\n- **HPE's $14 billion Juniper acquisition could face state challenge**\\\\\nhpe s 14 billion juniper acquisition could face state challenge\n- **Only 17% of Indian organisations fully ready to capture AI value: Cisco report**\\\\\nonly 17 of indian organisations fully ready to capture ai value cisco report\n- **Make in India: HFCL wins deal to deploy IP/MPLS routers for Vodafone Idea’s 5G network**\\\\\nmake in india hfcl wins deal to deploy ip mpls routers for vodafone idea s 5g network\n- **Cisco to set-up data centers in Mumbai, Chennai to launch Webex Calling, contact center services**\\\\\ncisco to set up data centers in mumbai chennai to launch webex calling contact center services\n- **HFCL bags contracts for 40-45% of GPs under BharatNet Phase 3, commences gear supply: Executive**\\\\\nhfcl bags contracts for 40 45 of gps under bharatnet phase 3 commences gear supply executive\n- **US sounds alarm over hackers targeting Cisco security devices**\\\\\nus sounds alarm over hackers targeting cisco security devices\n- **Cisco rolls out software aimed at connecting a quantum computing cloud**\\\\\ncisco rolls out software aimed at connecting a quantum computing cloud\n- **DoT extends deadline for mandatory testing of broadband gears until December 31**\\\\\ndot extends deadline for mandatory testing of broadband gears until december 31\n## Join the community of 2M+ industry professionals\nNewsletter icon\n### Subscribe to our Daily Newsletter\nEnter Email\nBy continuing you agree to our\nPrivacy Policy &\nTerms & Conditions\nDownload ETTelecom App for Realtime updates\nSeamless reading experience. Save your favourite.\nScan to download App\n[]( \"\")[]( \"\")\n## Download ETTelecom App for Realtime updates of content you follow\n- Seamless reading experience\n- Save your favourite articles\n[]( \"\")[]( \"App Store\")\nAdvertisement\n## More in CISCO\n- ### India's IT sector nervous as US proposes outsourcing tax\nIndia's $283 billion information technology sector has thrived for more than three decades exporting software services, with prominent clients including Apple, American Express, Cisco, Citigroup, FedEx and Home Depot. It has grown to make up over 7% of GDP.\nindia s it sector nervous as us proposes outsourcing tax\n- ### How US tech companies enabled China's digital police state\n​​Though the companies often claim they aren't responsible for how their products are used, some directly pitched their tech as tools for Chinese police to control citizens, marketing materials from IBM, Dell, Cisco, and Seagate show.\nhow us tech companies enabled china s digital police state\n- ### Tata Communications, Cisco partner to accelerate IoT deployments\nTata Communications will combine its “MOVE” eSIM orchestration solution with Cisco’s “IoT Control Center” to enable simplified and scalable IoT deployments globally.\ntata communications cisco partner to accelerate iot deployments\n- ### Check Point says India a fast-growing mkt, traction increasing for AI, Nvidia-powered solutions\nCheck Point estimates that Indian enterprises face an average of 3,247 cyberattacks per week, nearly double the global average of 1,981 over the last six months, a figure which it believes can be reduced via AI-enabled cyber solutions.\ncheck point says india a fast growing mkt traction increasing for ai nvidia powered solutions\n- ### Cisco does not aim to use AI to cut jobs, says Chuck Robbins: Report\nHe added that Cisco has adopted a balanced approach, utilising human expertise and agentic AI wherever applicable. ​The technology is capable of handling and executing complex tasks precisely with minimal-to-no human intervention, a trend that has sparked fears of mass layoffs in the telecoms and technology sectors.\ncisco does not aim to use ai to cut jobs says chuck robbins report\n- ### Cisco projects upbeat quarterly revenue as AI fuels networking equipment demand\nCisco's AI infrastructure orders exceeded $800 million in the fourth quarter, bringing the total for fiscal 2025 to over $2 billion, more than double its original target, CEO Chuck Robbins said on a post-earnings call.\ncisco projects upbeat quarterly revenue as ai fuels networking equipment demand\n- ### Ericsson, Nokia, Qualcomm, Cisco ink pacts with BSNL to train students in 5G, IoT, AI/ML\nTarun Chhabra, country head, Nokia India; Harish Krishnan, managing director & chief policy officer, Cisco; Nitin Bansal, MD, India head network solutions, South East Asia, Oceania & India, Ericsson India; Savi Soin, president, Qualcomm India; and Robert Ravi, CMD, BSNL, signed the MoUs.\nericsson nokia qualcomm cisco ink pacts with bsnl to train students in 5g iot ai ml\n- ### Cisco suffers data breach: How hackers used ‘voice attack’ to steal user information\nThe networking giant stated that the hackers accessed and exported a subset of user data, though the company did not specify the number of people affected.\ncisco suffers data breach how hackers used voice attack to steal user information\n- ### American Cisco to bolster Ambani's Jio hyperscale ambition, enable large data centres\n'They are setting up AI infrastructure, Jio Brain and they basically want to be the hyper scaler in India where they want to create large data centers, where they will host AI training, inferencing and cloud-based AI applications. We'll provide data centers, and the connectivity for them.'\n- Exclusive\namerican cisco to bolster ambani s jio hyperscale ambition enable large data centres\n- ### Starlink, Cisco team up for satellite-ready Wi-Fi routers\nChuck Robbins-headed Cisco's satellite-enabled routers provide two-way satellite communication and offer support for multicast and unicast traffic.\nstarlink cisco team up for satellite ready wi fi routers\n- ### Deploying made in India gear in BharatNet 3 program: Cisco's Daisy Chittilapilly\nSeveral bidders have won bids by quoting Cisco's network products, conforming to requirements.\ndeploying made in india gear in bharatnet 3 program cisco s daisy chittilapilly\nLoad More\nAdvertisement\nGet updates on your preferred social platform\nFollow us for the latest news, insider access to events and more.\nLinkedinTwitterYoutubeFacebookInstagram",
      "original_markdown_length": 6520,
      "processed_markdown_length": 6473,
      "compression_ratio": 0.9927914110429448
    },
    {
      "url": "https://cisco.edu/about/news-events",
      "title": "News & Events | Cisco College",
      "markdown": "Chat with Wrangler Bot\n\n# News & Events\n\n### Welcome to Cisco College News & Events, the place to discover the latest releases about campus events, student and faculty accomplishments, late-breaking news, emergency information, and Cisco College publications.\n\n### Media Contact: Cisco College Marketing and Public Relations presidents.office@cisco.edu 254.442.5113 (office)\n\n* * *\n\n### Cisco College News\n\n### Read the latest official news for Cisco College faculty, staff, students, parents, and alumni. The director of Marketing and Public Relations works with reporters and other media contacts to disseminate the official news for the College.\n\n### Press Release Abilene Chamber Of Commerce Endorsement Of Nickel Tax\n\n### Activities and Events\n\n### Mark your calendars so you can participate in all the exciting events Cisco College has planned.\n\n### The Wrangler Express\n\n### Check out the latest edition of our student produced Newspaper!\n\n### Campus Photo Gallery\n\n### Although nothing quite compares to being here in person, you can get a glimpse of campus events by viewing our photo galleries.\n\n* * *",
      "html": "",
      "metadata": {
        "title": "News & Events | Cisco College",
        "description": "News & Events",
        "language": "en-US",
        "sourceURL": "https://cisco.edu/about/news-events"
      },
      "content_type": "news",
      "success": true,
      "error": null,
      "scraped_at": "2025-10-24T10:47:42.922286",
      "processed_markdown": "Chat with Wrangler Bot\n# News & Events\n### Welcome to Cisco College News & Events, the place to discover the latest releases about campus events, student and faculty accomplishments, late-breaking news, emergency information, and Cisco College publications.\n### Media Contact: Cisco College Marketing and Public Relations presidents.office@cisco.edu 254.442.5113 (office)\n* * *\n### Cisco College News\n### Read the latest official news for Cisco College faculty, staff, students, parents, and alumni. The director of Marketing and Public Relations works with reporters and other media contacts to disseminate the official news for the College.\n### Press Release Abilene Chamber Of Commerce Endorsement Of Nickel Tax\n### Activities and Events\n### Mark your calendars so you can participate in all the exciting events Cisco College has planned.\n### The Wrangler Express\n### Check out the latest edition of our student produced Newspaper!\n### Campus Photo Gallery\n### Although nothing quite compares to being here in person, you can get a glimpse of campus events by viewing our photo galleries.\n* * *",
      "original_markdown_length": 1111,
      "processed_markdown_length": 1097,
      "compression_ratio": 0.9873987398739874
    },
    {
      "url": "https://itpro.com/business/software-engineers-among-hardest-hit-in-latest-cisco-layoffs",
      "title": "Software engineers among hardest hit in latest Cisco layoffs | IT Pro",
      "markdown": "ITPro\n\nSign up today and you will receive a free copy of our Future Focus 2025 report - the leading guidance on AI, cybersecurity and other IT challenges as per 700+ senior executives\n\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsors",
      "html": "",
      "metadata": {
        "title": "Software engineers among hardest hit in latest Cisco layoffs | IT Pro",
        "description": "Cisco is preparing for another round of layoffs, with software engineers among the hardest hit by the move.",
        "language": "en",
        "sourceURL": "https://itpro.com/business/software-engineers-among-hardest-hit-in-latest-cisco-layoffs"
      },
      "content_type": "news",
      "success": true,
      "error": null,
      "scraped_at": "2025-10-24T10:47:42.922319",
      "processed_markdown": "ITPro\nSign up today and you will receive a free copy of our Future Focus 2025 report - the leading guidance on AI, cybersecurity and other IT challenges as per 700+ senior executives\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsors",
      "original_markdown_length": 308,
      "processed_markdown_length": 306,
      "compression_ratio": 0.9935064935064936
    },
    {
      "url": "https://netacad.com/articles/news/download-cisco-packet-tracer",
      "title": "Cisco Networking Academy",
      "markdown": "Skip to main content Skip to footer\n\n- []\n- Catalog\n- Articles\n- News\n- Level up your skills with Cisco Packet Tracer 9.0.0\n\n# Level up your skills with Cisco Packet Tracer 9.0.0\n\nPractice entry-level industrial skills, configure devices, troubleshoot, and learn security—all on your PC.\n\nDate\n\n17 Oct 2025\n\nLevel up your skills with Cisco Packet Tracer 9.0.0 \\| Time to use Cisco Packet Tracer v8.2.2\n\n## Level up your skills with Cisco Packet Tracer 9.0.0\n\nSkip navigation\n\narrow\\_back\n\nCompleted  Time to use Cisco Packet Tracer v8.2.2\n\nCompleted Time to use Cisco Packet Tracer v8.2.2\n\nThe latest version of Cisco Packet Tracer, version 9.0, is now available to all learners! This release brings expanded functionalities designed for entry-level industrial skills, enabling you to practice industrial processes, device connectivity and configuration, troubleshooting, and security—all from your PC.\n\n## New in Packet Tracer 9.0.0\n\n- **New Cisco C8200 Router Model:** Experience a new device for your lab activities.\n- **Improved Fiber Optic Connections:** Simulations are now more realistic than ever.\n- **Enhanced Accessibility:** All web views and lab instructions are easier to navigate and use for everyone.\n- **Simplified Login Experience:** Enjoy a faster, more streamlined login process.\n- **Stability and Reliability Improvements:** Benefit from a smoother, more dependable user experience.\n\nCisco Packet Tracer Version 9.0.0 is now the required version for all Operational Technology (OT) courses, including:\n\n- Industrial Networking Essentials\n- Industrial IoT and Control Systems in Energy\n- Industrial IoT and Control Systems in Manufacturing\n- Industrial Cybersecurity Essentials\n\nDownload Cisco Packet Tracer 9.0.0 today and experience the latest in hands-on network simulation!",
      "html": "",
      "metadata": {
        "title": "Cisco Networking Academy",
        "description": null,
        "language": "en-US",
        "sourceURL": "https://netacad.com/articles/news/download-cisco-packet-tracer"
      },
      "content_type": "news",
      "success": true,
      "error": null,
      "scraped_at": "2025-10-24T10:47:42.922490",
      "processed_markdown": "Skip to main content Skip to footer\n- []\n- Catalog\n- Articles\n- News\n- Level up your skills with Cisco Packet Tracer 9.0.0\n# Level up your skills with Cisco Packet Tracer 9.0.0\nPractice entry-level industrial skills, configure devices, troubleshoot, and learn security—all on your PC.\nDate\n17 Oct 2025\nLevel up your skills with Cisco Packet Tracer 9.0.0 \\| Time to use Cisco Packet Tracer v8.2.2\n## Level up your skills with Cisco Packet Tracer 9.0.0\nSkip navigation\narrow\\_back\nCompleted  Time to use Cisco Packet Tracer v8.2.2\nCompleted Time to use Cisco Packet Tracer v8.2.2\nThe latest version of Cisco Packet Tracer, version 9.0, is now available to all learners! This release brings expanded functionalities designed for entry-level industrial skills, enabling you to practice industrial processes, device connectivity and configuration, troubleshooting, and security—all from your PC.\n## New in Packet Tracer 9.0.0\n- **New Cisco C8200 Router Model:** Experience a new device for your lab activities.\n- **Improved Fiber Optic Connections:** Simulations are now more realistic than ever.\n- **Enhanced Accessibility:** All web views and lab instructions are easier to navigate and use for everyone.\n- **Simplified Login Experience:** Enjoy a faster, more streamlined login process.\n- **Stability and Reliability Improvements:** Benefit from a smoother, more dependable user experience.\nCisco Packet Tracer Version 9.0.0 is now the required version for all Operational Technology (OT) courses, including:\n- Industrial Networking Essentials\n- Industrial IoT and Control Systems in Energy\n- Industrial IoT and Control Systems in Manufacturing\n- Industrial Cybersecurity Essentials\nDownload Cisco Packet Tracer 9.0.0 today and experience the latest in hands-on network simulation!",
      "original_markdown_length": 1796,
      "processed_markdown_length": 1779,
      "compression_ratio": 0.9905345211581291
    }
  ],
  "search_results_summary": {
    "official_website": "https://cisco.com/",
    "news_count": 9,
    "case_studies_count": 10,
    "total_search_results": 0
  },
  "scraping_timestamp": "2025-10-24T10:47:43.767947",
  "content_processing": {
    "processed_items": 8,
    "total_items": 8,
    "processing_timestamp": "2025-10-24T10:47:43.767962"
  }
}